ELARABY-AI-Team/Main_Generator/MCAL_C_Files/STM32F401RC_MCAL.c
/**
 * @file MCAL.c
 * @brief Microcontroller Abstraction Layer (MCAL) for STM32F401RC.
 *
 * This file implements the MCAL APIs based on the provided register definitions
 * and coding rules. It handles low-level access to MCU peripherals like
 * GPIO, RCC, EXTI, ADC, Timers, USART, I2C, SPI, and Flash.
 *
 * MCU Name: STM32F401RC
 */

/* =========================================================================
 *                   CORE INCLUDES AND DATA TYPE DEFINITIONS
 * =========================================================================*/

#include "MCAL.h"                       // MCAL API prototypes and types
#include "stm32f401xc.h"                // Core device header for STM32F401RC
#include <stdint.h>                     // Standard integer types
#include <stdbool.h>                    // Standard boolean type
#include <stddef.h>                     // Standard definitions (e.g., size_t)
#include <string.h>                     // String manipulation functions
#include <stdio.h>                      // Standard I/O functions (for debug or specific needs)
#include <stdlib.h>                     // General utilities
#include <math.h>                       // Math functions

// Data type definitions as per Rules.json
#define tbyte   uint8_t
#define tword   uint16_t
#define tlong   uint32_t
#define tsbyte  int8_t
#define tsword  int16_t
#define tslong  int32_t

/* =========================================================================
 *                   REGISTER ADDRESS DEFINITIONS
 * =========================================================================*/

// Define volatile pointers for register access
#define REG_ACCESS(addr) (*((volatile uint32_t *)(addr)))

// FLASH Registers
#define FLASH_ACR_ADDR      ((volatile uint32_t)0x40023C00)
#define FLASH_KEYR_ADDR     ((volatile uint32_t)0x40023C04)
#define FLASH_OPTKEYR_ADDR  ((volatile uint32_t)0x40023C08)
#define FLASH_SR_ADDR       ((volatile uint32_t)0x40023C0C)
#define FLASH_CR_ADDR       ((volatile uint32_t)0x40023C10)
#define FLASH_OPTCR_ADDR    ((volatile uint32_t)0x40023C14)

// RCC Registers
#define RCC_CR_ADDR         ((volatile uint32_t)0x40023800)
#define RCC_PLLCFGR_ADDR    ((volatile uint32_t)0x40023804)
#define RCC_CFGR_ADDR       ((volatile uint32_t)0x40023808)
#define RCC_CIR_ADDR        ((volatile uint32_t)0x4002380C)
#define RCC_AHB1RSTR_ADDR   ((volatile uint32_t)0x40023810)
#define RCC_AHB2RSTR_ADDR   ((volatile uint32_t)0x40023814)
#define RCC_APB1RSTR_ADDR   ((volatile uint32_t)0x40023818)
#define RCC_APB2RSTR_ADDR   ((volatile uint32_t)0x4002381C)
#define RCC_AHB1ENR_ADDR    ((volatile uint32_t)0x40023830)
#define RCC_AHB2ENR_ADDR    ((volatile uint32_t)0x40023834)
#define RCC_APB1ENR_ADDR    ((volatile uint32_t)0x40023838)
#define RCC_APB2ENR_ADDR    ((volatile uint32_t)0x4002383C)
#define RCC_AHB1LPENR_ADDR  ((volatile uint32_t)0x40023840)
#define RCC_AHB2LPENR_ADDR  ((volatile uint32_t)0x40023844)
#define RCC_APB1LPENR_ADDR  ((volatile uint32_t)0x40023848)
#define RCC_APB2LPENR_ADDR  ((volatile uint32_t)0x4002384C)
#define RCC_BDCR_ADDR       ((volatile uint32_t)0x40023850)
#define RCC_CSR_ADDR        ((volatile uint32_t)0x40023854)
#define RCC_SSCGR_ADDR      ((volatile uint32_t)0x40023858)
#define RCC_PLLI2SCFGR_ADDR ((volatile uint32_t)0x4002385C)
#define RCC_DCKCFGR_ADDR    ((volatile uint32_t)0x40023864)

// SYSCFG Registers
#define SYSCFG_MEMRMP_ADDR  ((volatile uint32_t)0x40013800)
#define SYSCFG_PMC_ADDR     ((volatile uint32_t)0x40013804)
#define SYSCFG_EXTICR1_ADDR ((volatile uint32_t)0x40013808)
#define SYSCFG_EXTICR2_ADDR ((volatile uint32_t)0x4001380C)
#define SYSCFG_EXTICR3_ADDR ((volatile uint32_t)0x40013810)
#define SYSCFG_EXTICR4_ADDR ((volatile uint32_t)0x40013814)
#define SYSCFG_CMPCR_ADDR   ((volatile uint32_t)0x40013820)

// GPIO Port Addresses (Base)
#define GPIOA_BASE_ADDR     ((volatile uint32_t)0x40020000)
#define GPIOB_BASE_ADDR     ((volatile uint32_t)0x40020400)
#define GPIOC_BASE_ADDR     ((volatile uint32_t)0x40020800)
#define GPIOD_BASE_ADDR     ((volatile uint32_t)0x40020C00)
#define GPIOE_BASE_ADDR     ((volatile uint32_t)0x40021000)
#define GPIOH_BASE_ADDR     ((volatile uint32_t)0x40021C00)

// GPIO Register Offsets
#define GPIO_MODER_OFFSET   0x00
#define GPIO_OTYPER_OFFSET  0x04
#define GPIO_OSPEEDR_OFFSET 0x08
#define GPIO_PUPDR_OFFSET   0x0C
#define GPIO_IDR_OFFSET     0x10
#define GPIO_ODR_OFFSET     0x14
#define GPIO_BSRR_OFFSET    0x18
#define GPIO_LCKR_OFFSET    0x1C
#define GPIO_AFRL_OFFSET    0x20
#define GPIO_AFRH_OFFSET    0x24

// EXTI Registers
#define EXTI_IMR_ADDR       ((volatile uint32_t)0x40013C00)
#define EXTI_EMR_ADDR       ((volatile uint32_t)0x40013C04)
#define EXTI_RTSR_ADDR      ((volatile uint32_t)0x40013C08)
#define EXTI_FTSR_ADDR      ((volatile uint32_t)0x40013C0C)
#define EXTI_SWIER_ADDR     ((volatile uint32_t)0x40013C10)
#define EXTI_PR_ADDR        ((volatile uint32_t)0x40013C14)

// ADC Registers
#define ADC1_SR_ADDR        ((volatile uint32_t)0x40012000)
#define ADC1_CR1_ADDR       ((volatile uint32_t)0x40012004)
#define ADC1_CR2_ADDR       ((volatile uint32_t)0x40012008)
#define ADC1_SMPR1_ADDR     ((volatile uint32_t)0x4001200C)
#define ADC1_SMPR2_ADDR     ((volatile uint32_t)0x40012010)
#define ADC1_JOFR1_ADDR     ((volatile uint32_t)0x40012014)
#define ADC1_JOFR2_ADDR     ((volatile uint32_t)0x40012018)
#define ADC1_JOFR3_ADDR     ((volatile uint32_t)0x4001201C)
#define ADC1_JOFR4_ADDR     ((volatile uint32_t)0x40012020)
#define ADC1_HTR_ADDR       ((volatile uint32_t)0x40012024)
#define ADC1_LTR_ADDR       ((volatile uint32_t)0x40012028)
#define ADC1_SQR1_ADDR      ((volatile uint32_t)0x4001202C)
#define ADC1_SQR2_ADDR      ((volatile uint32_t)0x40012030)
#define ADC1_SQR3_ADDR      ((volatile uint32_t)0x40012034)
#define ADC1_JSQR_ADDR      ((volatile uint32_t)0x40012038)
#define ADC1_JDR1_ADDR      ((volatile uint32_t)0x4001203C)
#define ADC1_JDR2_ADDR      ((volatile uint32_t)0x40012040)
#define ADC1_JDR3_ADDR      ((volatile uint32_t)0x40012044)
#define ADC1_JDR4_ADDR      ((volatile uint32_t)0x40012048)
#define ADC1_DR_ADDR        ((volatile uint32_t)0x4001204C)
#define ADC_CCR_ADDR        ((volatile uint32_t)0x40012304)

