ELARABY-AI-Team/Main_Generator/MCAL_C_Files/STM32F401RC_MCAL.c
// Timer Registers (Base addresses and offsets)
// Timer 1 is APB2, others are APB1
#define TIM1_BASE_ADDR      ((volatile uint32_t)0x40010000)
#define TIM2_BASE_ADDR      ((volatile uint32_t)0x40000000)
#define TIM3_BASE_ADDR      ((volatile uint32_t)0x40000400)
#define TIM4_BASE_ADDR      ((volatile uint32_t)0x40000800)
#define TIM5_BASE_ADDR      ((volatile uint32_t)0x40000C00)
#define TIM9_BASE_ADDR      ((volatile uint32_t)0x40014000)
#define TIM10_BASE_ADDR     ((volatile uint32_t)0x40014400)
#define TIM11_BASE_ADDR     ((volatile uint32_t)0x40014800)

#define TIM_CR1_OFFSET      0x00
#define TIM_CR2_OFFSET      0x04
#define TIM_SMCR_OFFSET     0x08
#define TIM_DIER_OFFSET     0x0C
#define TIM_SR_OFFSET       0x10
#define TIM_EGR_OFFSET      0x14
#define TIM_CCMR1_OFFSET    0x18
#define TIM_CCMR2_OFFSET    0x1C
#define TIM_CCER_OFFSET     0x20
#define TIM_CNT_OFFSET      0x24
#define TIM_PSC_OFFSET      0x28
#define TIM_ARR_OFFSET      0x2C
#define TIM_RCR_OFFSET      0x30
#define TIM_CCR1_OFFSET     0x34
#define TIM_CCR2_OFFSET     0x38
#define TIM_CCR3_OFFSET     0x3C
#define TIM_CCR4_OFFSET     0x40
#define TIM_BDTR_OFFSET     0x44
#define TIM_DCR_OFFSET      0x48
#define TIM_DMAR_OFFSET     0x4C
#define TIM_OR_OFFSET       0x50 // Only for TIM2/5

// USART Registers
// USART1, USART6 are APB2. USART2 is APB1.
#define USART1_BASE_ADDR    ((volatile uint32_t)0x40011000)
#define USART2_BASE_ADDR    ((volatile uint32_t)0x40004400)
#define USART6_BASE_ADDR    ((volatile uint32_t)0x40011400)

#define USART_SR_OFFSET     0x00
#define USART_DR_OFFSET     0x04
#define USART_BRR_OFFSET    0x08
#define USART_CR1_OFFSET    0x0C
#define USART_CR2_OFFSET    0x10
#define USART_CR3_OFFSET    0x14
#define USART_GTPR_OFFSET   0x18

// I2C Registers
// I2C1, I2C2, I2C3 are APB1
#define I2C1_BASE_ADDR      ((volatile uint32_t)0x40005400)
#define I2C2_BASE_ADDR      ((volatile uint32_t)0x40005800)
#define I2C3_BASE_ADDR      ((volatile uint32_t)0x40005C00)

#define I2C_CR1_OFFSET      0x00
#define I2C_CR2_OFFSET      0x04
#define I2C_OAR1_OFFSET     0x08
#define I2C_OAR2_OFFSET     0x0C
#define I2C_DR_OFFSET       0x10
#define I2C_SR1_OFFSET      0x14
#define I2C_SR2_OFFSET      0x18
#define I2C_CCR_OFFSET      0x1C
#define I2C_TRISE_OFFSET    0x20
#define I2C_FLTR_OFFSET     0x24

// SPI Registers
// SPI1 is APB2. SPI2, SPI3 are APB1.
#define SPI1_BASE_ADDR      ((volatile uint32_t)0x40013000)
#define SPI2_BASE_ADDR      ((volatile uint32_t)0x40003800)
#define SPI3_BASE_ADDR      ((volatile uint32_t)0x40003C00)

#define SPI_CR1_OFFSET      0x00
#define SPI_CR2_OFFSET      0x04
#define SPI_SR_OFFSET       0x08
#define SPI_DR_OFFSET       0x0C
#define SPI_CRCPR_OFFSET    0x10
#define SPI_RXCRCR_OFFSET   0x14
#define SPI_TXCRCR_OFFSET   0x18
#define SPI_I2SCFGR_OFFSET  0x1C
#define SPI_I2SPR_OFFSET    0x20

// Watchdog (IWDG - Inferred for STM32F401RC)
#define IWDG_BASE_ADDR      ((volatile uint32_t)0x40003000)
#define IWDG_KR_ADDR        (IWDG_BASE_ADDR + 0x00) // Key register
#define IWDG_PR_ADDR        (IWDG_BASE_ADDR + 0x04) // Prescaler register
#define IWDG_RLR_ADDR       (IWDG_BASE_ADDR + 0x08) // Reload register
#define IWDG_SR_ADDR        (IWDG_BASE_ADDR + 0x0C) // Status register

// Power Control (PWR - Inferred for STM32F401RC PVD)
#define PWR_BASE_ADDR       ((volatile uint32_t)0x40007000)
#define PWR_CR_ADDR         (PWR_BASE_ADDR + 0x00) // Control register
#define PWR_CSR_ADDR        (PWR_BASE_ADDR + 0x04) // Control Status register


/* =========================================================================
 *                   COMMON BIT DEFINITIONS (INFERRED FOR STM32)
 * =========================================================================*/

// RCC Clock Enable Bits
#define RCC_AHB1ENR_GPIOAEN_Pos     (0U)
#define RCC_AHB1ENR_GPIOBEN_Pos     (1U)
#define RCC_AHB1ENR_GPIOCEN_Pos     (2U)
#define RCC_AHB1ENR_GPIODEN_Pos     (3U)
#define RCC_AHB1ENR_GPIOEEN_Pos     (4U)
#define RCC_AHB1ENR_GPIOHEN_Pos     (7U) // GPIOH for STM32F401RC

#define RCC_APB1ENR_TIM2EN_Pos      (0U)
#define RCC_APB1ENR_TIM3EN_Pos      (1U)
#define RCC_APB1ENR_TIM4EN_Pos      (2U)
#define RCC_APB1ENR_TIM5EN_Pos      (3U)
#define RCC_APB1ENR_USART2EN_Pos    (17U)
#define RCC_APB1ENR_I2C1EN_Pos      (21U)
#define RCC_APB1ENR_I2C2EN_Pos      (22U)
#define RCC_APB1ENR_I2C3EN_Pos      (23U)
#define RCC_APB1ENR_SPI2EN_Pos      (14U)
#define RCC_APB1ENR_SPI3EN_Pos      (15U)
#define RCC_APB1ENR_PWREN_Pos       (28U) // Power interface clock enable

#define RCC_APB2ENR_TIM1EN_Pos      (0U)
#define RCC_APB2ENR_USART1EN_Pos    (4U)
#define RCC_APB2ENR_USART6EN_Pos    (5U)
#define RCC_APB2ENR_ADC1EN_Pos      (8U)
#define RCC_APB2ENR_SPI1EN_Pos      (12U)
#define RCC_APB2ENR_SYSCFGEN_Pos    (14U)
#define RCC_APB2ENR_TIM9EN_Pos      (18U)
#define RCC_APB2ENR_TIM10EN_Pos     (17U)
#define RCC_APB2ENR_TIM11EN_Pos     (18U) // Note: TIM9, TIM10, TIM11 in APB2. TIM10 and TIM11 might share a bit or be distinct on different F4s. Assuming distinct for now.

// IWDG Keys
#define IWDG_KR_KEY_ENABLE          (0xCCCCUL)
#define IWDG_KR_KEY_RELOAD          (0xAAAAUL)
#define IWDG_KR_KEY_ACCESS          (0x5555UL)

// PWR_CR PVD Selection (PLS bits) and PVDEN bit
#define PWR_CR_PVDE_Pos             (4U)
#define PWR_CR_PLS_Pos              (5U)
#define PWR_CR_PLS_Msk              (0x7U << PWR_CR_PLS_Pos)
#define PWR_CR_PVDEN                (1U << PWR_CR_PVDE_Pos)

/* =========================================================================
 *                   PRIVATE HELPER FUNCTIONS
 * =========================================================================*/

/**
 * @brief Get the base address for a given GPIO port.
 * @param port The GPIO port (A, B, C, D, E, H).
 * @return Volatile uint32_t pointer to the GPIO port base address.
 */
static volatile uint32_t *get_gpio_port_base_addr(t_port port) {
    volatile uint32_t *base_addr;
    switch (port) {
        case PORTA: base_addr = (volatile uint32_t *)GPIOA_BASE_ADDR; break;
        case PORTB: base_addr = (volatile uint32_t *)GPIOB_BASE_ADDR; break;
        case PORTC: base_addr = (volatile uint32_t *)GPIOC_BASE_ADDR; break;
        case PORTD: base_addr = (volatile uint32_t *)GPIOD_BASE_ADDR; break;
        case PORTE: base_addr = (volatile uint32_t *)GPIOE_BASE_ADDR; break;
        case PORTH: base_addr = (volatile uint32_t *)GPIOH_BASE_ADDR; break;
        default: base_addr = NULL; break; // Should not happen with valid t_port
    }
    return base_addr;
}

/**
 * @brief Get the base address for a given Timer channel.
 * @param timer_channel The timer channel.
 * @return Volatile uint32_t pointer to the Timer base address.
 */
static volatile uint32_t *get_timer_base_addr(t_timer_channel timer_channel) {
    volatile uint32_t *base_addr;
    switch (timer_channel) {
        case TIMER_CH_1:
        case TIMER_CH_2:
        case TIMER_CH_3:
        case TIMER_CH_4:
        case PWM_CHANNEL_TIM1_CH1:
        case PWM_CHANNEL_TIM1_CH2:
        case PWM_CHANNEL_TIM1_CH3:
        case PWM_CHANNEL_TIM1_CH4:
        case ICU_CHANNEL_TIM1_CH1:
        case ICU_CHANNEL_TIM1_CH2:
        case ICU_CHANNEL_TIM1_CH3:
        case ICU_CHANNEL_TIM1_CH4:
            base_addr = (volatile uint32_t *)TIM1_BASE_ADDR; break;
        case TIMER_CH_5:
        case TIMER_CH_6:
        case TIMER_CH_7:
        case TIMER_CH_8:
        case PWM_CHANNEL_TIM2_CH1:
        case PWM_CHANNEL_TIM2_CH2:
        case PWM_CHANNEL_TIM2_CH3:
        case PWM_CHANNEL_TIM2_CH4:
        case ICU_CHANNEL_TIM2_CH1:
        case ICU_CHANNEL_TIM2_CH2:
        case ICU_CHANNEL_TIM2_CH3:
        case ICU_CHANNEL_TIM2_CH4:
            base_addr = (volatile uint32_t *)TIM2_BASE_ADDR; break;
        case TIMER_CH_9:
        case TIMER_CH_10:
        case TIMER_CH_11:
        case TIMER_CH_12:
        case PWM_CHANNEL_TIM3_CH1:
        case PWM_CHANNEL_TIM3_CH2:
        case PWM_CHANNEL_TIM3_CH3:
        case PWM_CHANNEL_TIM3_CH4:
        case ICU_CHANNEL_TIM3_CH1:
        case ICU_CHANNEL_TIM3_CH2:
        case ICU_CHANNEL_TIM3_CH3:
        case ICU_CHANNEL_TIM3_CH4:
            base_addr = (volatile uint32_t *)TIM3_BASE_ADDR; break;
        case TIMER_CH_13:
        case TIMER_CH_14:
        case TIMER_CH_15:
        case TIMER_CH_16:
        case PWM_CHANNEL_TIM4_CH1:
        case PWM_CHANNEL_TIM4_CH2:
        case PWM_CHANNEL_TIM4_CH3:
        case PWM_CHANNEL_TIM4_CH4:
        case ICU_CHANNEL_TIM4_CH1:
        case ICU_CHANNEL_TIM4_CH2:
        case ICU_CHANNEL_TIM4_CH3:
        case ICU_CHANNEL_TIM4_CH4:
            base_addr = (volatile uint32_t *)TIM4_BASE_ADDR; break;
        case TIMER_CH_17:
        case TIMER_CH_18:
        case TIMER_CH_19:
        case TIMER_CH_20:
        case PWM_CHANNEL_TIM5_CH1:
        case PWM_CHANNEL_TIM5_CH2:
        case PWM_CHANNEL_TIM5_CH3:
        case PWM_CHANNEL_TIM5_CH4:
        case ICU_CHANNEL_TIM5_CH1:
        case ICU_CHANNEL_TIM5_CH2:
        case ICU_CHANNEL_TIM5_CH3:
        case ICU_CHANNEL_TIM5_CH4:
            base_addr = (volatile uint32_t *)TIM5_BASE_ADDR; break;
        case PWM_CHANNEL_TIM9_CH1:
        case PWM_CHANNEL_TIM9_CH2:
        case ICU_CHANNEL_TIM9_CH1:
        case ICU_CHANNEL_TIM9_CH2:
            base_addr = (volatile uint32_t *)TIM9_BASE_ADDR; break;
        case PWM_CHANNEL_TIM10_CH1:
        case ICU_CHANNEL_TIM10_CH1:
            base_addr = (volatile uint32_t *)TIM10_BASE_ADDR; break;
        case PWM_CHANNEL_TIM11_CH1:
        case ICU_CHANNEL_TIM11_CH1:
            base_addr = (volatile uint32_t *)TIM11_BASE_ADDR; break;
        default: base_addr = NULL; break;
    }
    return base_addr;
}

/* =========================================================================
 *                   API IMPLEMENTATIONS
 * =========================================================================*/

/**
 * @brief Resets the Independent Watchdog Timer (IWDG).
 *        This function reloads the IWDG counter to prevent a reset.
 *        Inferred for STM32F401RC, as IWDG registers were not in register_json.
 */
void WDT_Reset(void) {
    // Write 0xAAAA in the IWDG_KR register to reload the watchdog counter
    REG_ACCESS(IWDG_KR_ADDR) = IWDG_KR_KEY_RELOAD;
}

/**
 * @brief Initializes the MCU configurations including GPIO, peripheral clocks,
 *        Watchdog, and Low Voltage Reset.
 * @param volt The system voltage level (e.g., Vsource_3V, Vsource_5V).
 */
void MCU_Config_Init(t_sys_volt volt) {
    WDT_Reset(); // Call WDT_Reset before any other operation

    volatile uint32_t *gpio_base;
    t_port current_port;
    t_pin current_pin;

    // 1. Set all GPIO pins to 0 and verify with while loop
    for (current_port = PORTA; current_port <= PORTH; current_port++) {
        if (current_port == PORTF || current_port == PORTG) continue; // STM32F401RC does not have Port F/G
        gpio_base = get_gpio_port_base_addr(current_port);
        if (gpio_base == NULL) continue;

        // Enable GPIO clock first (inferred)
        REG_ACCESS(RCC_AHB1ENR_ADDR) |= (1U << current_port); // Port A=0, B=1, ... H=7

        REG_ACCESS(gpio_base + GPIO_ODR_OFFSET) = 0x00000000UL;
        while (REG_ACCESS(gpio_base + GPIO_ODR_OFFSET) != 0x00000000UL) {
            // Wait for ODR to be cleared
        }
    }
    WDT_Reset();

    // 2. Set all GPIO pins direction to input and verify with while loop
    for (current_port = PORTA; current_port <= PORTH; current_port++) {
        if (current_port == PORTF || current_port == PORTG) continue; // STM32F401RC does not have Port F/G
        gpio_base = get_gpio_port_base_addr(current_port);
        if (gpio_base == NULL) continue;

        // Set all MODER bits to 0x00 (Input mode) for all 16 pins
        REG_ACCESS(gpio_base + GPIO_MODER_OFFSET) = 0x00000000UL;
        while (REG_ACCESS(gpio_base + GPIO_MODER_OFFSET) != 0x00000000UL) {
            // Wait for MODER to be cleared
        }
        // All input pins have pull-up resistors and wakeup feature enabled (if available)
        // Set all PUPDR bits to 0x01 (Pull-up)
        REG_ACCESS(gpio_base + GPIO_PUPDR_OFFSET) = 0x55555555UL; // 01 for each pin (16 * 2 bits)
    }
    WDT_Reset();

