ELARABY-AI-Team/Main_Generator/MCAL_C_Files/STM32F401RC_MCAL.c
    // 3. Disable all features (global interrupt, ADC, UART, I2S, SPI, TIMER, etc.)
    Global_interrupt_Disable();
    WDT_Reset();

    // Disable ADC1
    REG_ACCESS(ADC1_CR2_ADDR) &= ~(1U << 0); // Clear ADON bit (ADON is bit 0)
    REG_ACCESS(RCC_APB2ENR_ADDR) &= ~(1U << RCC_APB2ENR_ADC1EN_Pos); // Infer: RCC_APB2ENR, bit 8 for ADC1EN
    WDT_Reset();

    // Disable USARTs
    REG_ACCESS(USART1_BASE_ADDR + USART_CR1_OFFSET) &= ~(1U << 13); // Clear UE bit
    REG_ACCESS(RCC_APB2ENR_ADDR) &= ~(1U << RCC_APB2ENR_USART1EN_Pos); // Infer: RCC_APB2ENR, bit 4 for USART1EN
    WDT_Reset();

    REG_ACCESS(USART2_BASE_ADDR + USART_CR1_OFFSET) &= ~(1U << 13); // Clear UE bit
    REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_USART2EN_Pos); // Infer: RCC_APB1ENR, bit 17 for USART2EN
    WDT_Reset();

    REG_ACCESS(USART6_BASE_ADDR + USART_CR1_OFFSET) &= ~(1U << 13); // Clear UE bit
    REG_ACCESS(RCC_APB2ENR_ADDR) &= ~(1U << RCC_APB2ENR_USART6EN_Pos); // Infer: RCC_APB2ENR, bit 5 for USART6EN
    WDT_Reset();

    // Disable SPIs and I2Ss (SPI peripherals include I2S)
    REG_ACCESS(SPI1_BASE_ADDR + SPI_CR1_OFFSET) &= ~(1U << 6); // Clear SPE bit
    REG_ACCESS(SPI1_BASE_ADDR + SPI_I2SCFGR_OFFSET) &= ~(1U << 7); // Clear I2SE bit
    REG_ACCESS(RCC_APB2ENR_ADDR) &= ~(1U << RCC_APB2ENR_SPI1EN_Pos); // Infer: RCC_APB2ENR, bit 12 for SPI1EN
    WDT_Reset();

    REG_ACCESS(SPI2_BASE_ADDR + SPI_CR1_OFFSET) &= ~(1U << 6); // Clear SPE bit
    REG_ACCESS(SPI2_BASE_ADDR + SPI_I2SCFGR_OFFSET) &= ~(1U << 7); // Clear I2SE bit
    REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_SPI2EN_Pos); // Infer: RCC_APB1ENR, bit 14 for SPI2EN
    WDT_Reset();

    REG_ACCESS(SPI3_BASE_ADDR + SPI_CR1_OFFSET) &= ~(1U << 6); // Clear SPE bit
    REG_ACCESS(SPI3_BASE_ADDR + SPI_I2SCFGR_OFFSET) &= ~(1U << 7); // Clear I2SE bit
    REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_SPI3EN_Pos); // Infer: RCC_APB1ENR, bit 15 for SPI3EN
    WDT_Reset();

    // Disable I2Cs
    REG_ACCESS(I2C1_BASE_ADDR + I2C_CR1_OFFSET) &= ~(1U << 0); // Clear PE bit
    REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_I2C1EN_Pos); // Infer: RCC_APB1ENR, bit 21 for I2C1EN
    WDT_Reset();

    REG_ACCESS(I2C2_BASE_ADDR + I2C_CR1_OFFSET) &= ~(1U << 0); // Clear PE bit
    REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_I2C2EN_Pos); // Infer: RCC_APB1ENR, bit 22 for I2C2EN
    WDT_Reset();

    REG_ACCESS(I2C3_BASE_ADDR + I2C_CR1_OFFSET) &= ~(1U << 0); // Clear PE bit
    REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_I2C3EN_Pos); // Infer: RCC_APB1ENR, bit 23 for I2C3EN
    WDT_Reset();

    // Disable Timers
    REG_ACCESS(TIM1_BASE_ADDR + TIM_CR1_OFFSET) &= ~(1U << 0); // Clear CEN bit
    REG_ACCESS(RCC_APB2ENR_ADDR) &= ~(1U << RCC_APB2ENR_TIM1EN_Pos);
    WDT_Reset();
    REG_ACCESS(TIM2_BASE_ADDR + TIM_CR1_OFFSET) &= ~(1U << 0); // Clear CEN bit
    REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_TIM2EN_Pos);
    WDT_Reset();
    REG_ACCESS(TIM3_BASE_ADDR + TIM_CR1_OFFSET) &= ~(1U << 0); // Clear CEN bit
    REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_TIM3EN_Pos);
    WDT_Reset();
    REG_ACCESS(TIM4_BASE_ADDR + TIM_CR1_OFFSET) &= ~(1U << 0); // Clear CEN bit
    REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_TIM4EN_Pos);
    WDT_Reset();
    REG_ACCESS(TIM5_BASE_ADDR + TIM_CR1_OFFSET) &= ~(1U << 0); // Clear CEN bit
    REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_TIM5EN_Pos);
    WDT_Reset();
    REG_ACCESS(TIM9_BASE_ADDR + TIM_CR1_OFFSET) &= ~(1U << 0); // Clear CEN bit
    REG_ACCESS(RCC_APB2ENR_ADDR) &= ~(1U << RCC_APB2ENR_TIM9EN_Pos);
    WDT_Reset();
    REG_ACCESS(TIM10_BASE_ADDR + TIM_CR1_OFFSET) &= ~(1U << 0); // Clear CEN bit
    REG_ACCESS(RCC_APB2ENR_ADDR) &= ~(1U << RCC_APB2ENR_TIM10EN_Pos);
    WDT_Reset();
    REG_ACCESS(TIM11_BASE_ADDR + TIM_CR1_OFFSET) &= ~(1U << 0); // Clear CEN bit
    REG_ACCESS(RCC_APB2ENR_ADDR) &= ~(1U << RCC_APB2ENR_TIM11EN_Pos);
    WDT_Reset();

    // 4. Enable WDT (Watchdog Timer) - Inferred for STM32 IWDG
    REG_ACCESS(IWDG_KR_ADDR) = IWDG_KR_KEY_ENABLE; // Enable IWDG
    WDT_Reset();

    // 5. Clear WDT timer (already done by enabling with 0xCCCC)
    // 6. Set WDT period >= 8 msec - Inferred for STM32 IWDG
    // LSI clock is ~32kHz. Prescaler = 32 (0x05) gives ~1ms per counter tick (32kHz / 32 = 1kHz)
    // Reload value 8 gives 8ms. Max reload value 0xFFF = 4095 ms ~ 4 seconds.
    REG_ACCESS(IWDG_PR_ADDR) = 0x05; // Prescaler: 32 (LSI / 32)
    REG_ACCESS(IWDG_RLR_ADDR) = 8; // Reload value for ~8ms (1kHz * 8ms = 8)
    WDT_Reset();

    // 7. Set LOW Voltage Reset value based on system voltage (2V for 3V, 3.5V for 5V)
    // 8. Enable LVR (Low Voltage Reset) - Inferred for STM32 PVD
    // PVD levels (PLS bits in PWR_CR):
    // 000: 2.2V, 001: 2.3V, 010: 2.4V, 011: 2.5V, 100: 2.6V, 101: 2.7V, 110: 2.8V, 111: 2.9V
    // Enable PWR clock first (inferred)
    REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_PWREN_Pos); // Inferred: RCC_APB1ENR, bit 28 for PWREN

    // Disable PVD before configuring
    REG_ACCESS(PWR_CR_ADDR) &= ~PWR_CR_PVDEN;
    WDT_Reset();

    if (volt == Vsource_3V) {
        // For 3V, aim for ~2V threshold. Closest available is 2.2V (PLS=0) or higher.
        // Let's use 2.2V (PLS=000)
        REG_ACCESS(PWR_CR_ADDR) &= ~PWR_CR_PLS_Msk; // Clear PLS bits
        // PLS is already 000 after clearing
    } else { // Vsource_5V
        // For 5V, aim for ~3.5V threshold. STM32 PVD max is 2.9V.
        // This is a limitation of the specific MCU's PVD range.
        // We'll use the highest available, 2.9V (PLS=111), and comment on the limitation.
        REG_ACCESS(PWR_CR_ADDR) |= (0x7U << PWR_CR_PLS_Pos); // Set PLS to 111 (2.9V)
        // Note: STM32F401RC PVD max threshold is 2.9V. A 3.5V threshold is not directly achievable
        // with the internal PVD. External supervisor IC would be needed for higher thresholds.
    }
    WDT_Reset();

    // Enable PVD
    REG_ACCESS(PWR_CR_ADDR) |= PWR_CR_PVDEN;
    WDT_Reset();

