ELARABY-AI-Team/Main_Generator/MCAL_C_Files/STM32F401RC_MCAL.c
    // 9. Clear WDT again
    WDT_Reset();
}

/**
 * @brief Enters the microcontroller into sleep mode (Wait-for-Interrupt).
 *        Stops CPU clock, peripherals may continue running.
 */
void Go_to_sleep_mode(void) {
    WDT_Reset();
    __WFI(); // Wait For Interrupt - Cortex-M specific instruction
}

/**
 * @brief Enables global interrupts.
 */
void Global_interrupt_Enable(void) {
    WDT_Reset();
    __enable_irq(); // Cortex-M specific instruction
}

/**
 * @brief Disables global interrupts.
 */
void Global_interrupt_Disable(void) {
    WDT_Reset();
    __disable_irq(); // Cortex-M specific instruction
}

// LVD (Low Voltage Detection) - Using STM32 PVD as proxy
// Note: STM32F401RC PVD (Programmable Voltage Detector) has thresholds from 2.2V to 2.9V.
// The requested API levels (0.5V, 1V, 1.5V, etc.) are not directly mappable.
// A custom mapping will be provided, or a warning for out-of-range requests.

/**
 * @brief Initializes the Low Voltage Detection (LVD) module.
 *        This function uses the STM32's internal PVD (Programmable Voltage Detector).
 *        Note: The available PVD thresholds on STM32F401RC are limited (2.2V to 2.9V).
 *        If thresholds outside this range are requested by LVD_Get/LVD_Enable,
 *        the closest valid PVD level or a default will be used.
 */
void LVD_Init(void) {
    WDT_Reset();
    // Enable PWR clock, already done in MCU_Config_Init.
    // Ensure PVD is disabled before configuration (if not already by MCU_Config_Init)
    REG_ACCESS(PWR_CR_ADDR) &= ~PWR_CR_PVDEN;
    WDT_Reset();
}

/**
 * @brief Sets the LVD threshold level.
 * @param lvd_thresholdLevel The desired threshold level.
 *        Note: For STM32F401RC, PVD thresholds range from 2.2V to 2.9V.
 *        Levels outside this will be mapped to the closest or default.
 */
void LVD_Get(t_lvd_thrthresholdLevel lvd_thresholdLevel) { // Naming convention mismatch: Get implies read, this sets.
    WDT_Reset();

    uint32_t pls_setting = 0; // Default to 2.2V

    // Mapping t_lvd_thrthresholdLevel to PWR_CR PLS bits
    switch (lvd_thresholdLevel) {
        case Volt_0_5V: // Not achievable directly. Map to lowest PVD.
        case Volt_1V:   // Not achievable directly. Map to lowest PVD.
        case Volt_1_5V: // Not achievable directly. Map to lowest PVD.
        case Volt_2V:   // Closest is 2.2V
            pls_setting = 0; break; // PLS = 000 (2.2V)
        case Volt_2_5V:
            pls_setting = 3; break; // PLS = 011 (2.5V)
        case Volt_3V:   // Closest is 2.9V (max)
        case Volt_3_5V: // Not achievable directly. Map to highest PVD.
        case Volt_4V:   // Not achievable directly. Map to highest PVD.
        case Volt_4_5V: // Not achievable directly. Map to highest PVD.
        case Volt_5V:   // Not achievable directly. Map to highest PVD.
            pls_setting = 7; break; // PLS = 111 (2.9V)
        default:
            pls_setting = 0; break; // Default to 2.2V if unknown
    }

    // Clear existing PLS bits
    REG_ACCESS(PWR_CR_ADDR) &= ~PWR_CR_PLS_Msk;
    // Set new PLS bits
    REG_ACCESS(PWR_CR_ADDR) |= (pls_setting << PWR_CR_PLS_Pos);
}

/**
 * @brief Enables the Low Voltage Detection (LVD) module.
 */
void LVD_Enable(void) {
    WDT_Reset();
    // Enable PWR clock, if not already by MCU_Config_Init.
    REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_PWREN_Pos); // Inferred

    // Enable PVD
    REG_ACCESS(PWR_CR_ADDR) |= PWR_CR_PVDEN;
}

/**
 * @brief Disables the Low Voltage Detection (LVD) module.
 */
void LVD_Disable(void) {
    WDT_Reset();
    // Disable PVD
    REG_ACCESS(PWR_CR_ADDR) &= ~PWR_CR_PVDEN;
}

// UART APIs
/**
 * @brief Initializes a specified UART channel with the given parameters.
 * @param uart_channel The UART channel to initialize (e.g., UART_CHANNEL_1).
 * @param uart_baud_rate The desired baud rate.
 * @param uart_data_length The data length (e.g., 8-bit, 9-bit).
 * @param uart_stop_bit The number of stop bits (e.g., 1 stop bit, 2 stop bits).
 * @param uart_parity The parity mode (e.g., Even, Odd, None).
 */
void UART_Init(t_uart_channel uart_channel, t_uart_baud_rate uart_baud_rate, t_uart_data_length uart_data_length, t_uart_stop_bit uart_stop_bit, t_uart_parity uart_parity) {
    WDT_Reset();
    volatile uint32_t *usart_base = NULL;
    uint32_t pclk_freq = 16000000; // Assuming PCLK1=16MHz for USART2, PCLK2=16MHz for USART1/6, check actual system clock setup

    // Determine USART base address and enable clock
    switch (uart_channel) {
        case UART_CHANNEL_1:
            usart_base = (volatile uint32_t *)USART1_BASE_ADDR;
            REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_USART1EN_Pos); // Infer: RCC_APB2ENR bit 4
            pclk_freq = 16000000; // Assuming APB2 clock (PCLK2) is 16MHz
            break;
        case UART_CHANNEL_2:
            usart_base = (volatile uint32_t *)USART2_BASE_ADDR;
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_USART2EN_Pos); // Infer: RCC_APB1ENR bit 17
            pclk_freq = 16000000; // Assuming APB1 clock (PCLK1) is 16MHz
            break;
        case UART_CHANNEL_6:
            usart_base = (volatile uint32_t *)USART6_BASE_ADDR;
            REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_USART6EN_Pos); // Infer: RCC_APB2ENR bit 5
            pclk_freq = 16000000; // Assuming APB2 clock (PCLK2) is 16MHz
            break;
        default:
            return; // Invalid channel
    }
    WDT_Reset();

    // Disable USART before configuration
    REG_ACCESS(usart_base + USART_CR1_OFFSET) &= ~(1U << 13); // Clear UE bit

    // Configure Baud Rate (Assuming Oversampling by 16)
    // BaudRate = PCLK / (8 * (2 - OVER8) * USARTDIV)
    // USARTDIV = PCLK / (16 * BaudRate)
    tword usartdiv = pclk_freq / (16 * uart_baud_rate);
    tword mantissa = usartdiv / 1;
    tword fraction = (usartdiv - mantissa) * 16;
    REG_ACCESS(usart_base + USART_BRR_OFFSET) = (mantissa << 4) | (fraction & 0xF);
    WDT_Reset();

    // Configure CR1: Data length, Parity, Transmit/Receive Enable
    uint32_t cr1_val = 0;
    if (uart_data_length == UART_DATA_LENGTH_9) {
        cr1_val |= (1U << 12); // M bit for 9-bit word length
    }
    if (uart_parity != UART_PARITY_NONE) {
        cr1_val |= (1U << 10); // PCE bit for parity control enable
        if (uart_parity == UART_PARITY_ODD) {
            cr1_val |= (1U << 9); // PS bit for odd parity
        }
    }
    cr1_val |= (1U << 2); // RE bit for Receiver enable
    cr1_val |= (1U << 3); // TE bit for Transmitter enable
    REG_ACCESS(usart_base + USART_CR1_OFFSET) = cr1_val;
    WDT_Reset();

    // Configure CR2: Stop bits
    uint32_t cr2_val = 0;
    if (uart_stop_bit == UART_STOP_BIT_2) {
        cr2_val |= (2U << 12); // STOP bits = 10 (2 stop bits)
    } else if (uart_stop_bit == UART_STOP_BIT_1_5) {
        cr2_val |= (3U << 12); // STOP bits = 11 (1.5 stop bits)
    } else { // UART_STOP_BIT_1
        cr2_val |= (0U << 12); // STOP bits = 00 (1 stop bit)
    }
    REG_ACCESS(usart_base + USART_CR2_OFFSET) = cr2_val;
    WDT_Reset();

    // Configure CR3 (DMA, Error, etc. - leave as default for basic init)
    REG_ACCESS(usart_base + USART_CR3_OFFSET) = 0;
    WDT_Reset();

    // Finally, enable USART (UE bit)
    REG_ACCESS(usart_base + USART_CR1_OFFSET) |= (1U << 13);
}

/**
 * @brief Enables a specified UART channel.
 * @param uart_channel The UART channel to enable.
 */
void UART_Enable(t_uart_channel uart_channel) {
    WDT_Reset();
    volatile uint32_t *usart_base = NULL;

