ELARABY-AI-Team/Main_Generator/MCAL_C_Files/STM32F401RC_MCAL.c
    switch (uart_channel) {
        case UART_CHANNEL_1:
            REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_USART1EN_Pos); // Enable peripheral clock (inferred)
            usart_base = (volatile uint32_t *)USART1_BASE_ADDR;
            break;
        case UART_CHANNEL_2:
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_USART2EN_Pos); // Enable peripheral clock (inferred)
            usart_base = (volatile uint32_t *)USART2_BASE_ADDR;
            break;
        case UART_CHANNEL_6:
            REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_USART6EN_Pos); // Enable peripheral clock (inferred)
            usart_base = (volatile uint32_t *)USART6_BASE_ADDR;
            break;
        default:
            return; // Invalid channel
    }
    WDT_Reset(); // Call WDT_Reset before setting the enable bit.

    if (usart_base != NULL) {
        REG_ACCESS(usart_base + USART_CR1_OFFSET) |= (1U << 13); // Set UE bit
    }
}

/**
 * @brief Disables a specified UART channel.
 * @param uart_channel The UART channel to disable.
 */
void UART_Disable(t_uart_channel uart_channel) {
    WDT_Reset();
    volatile uint32_t *usart_base = NULL;

    switch (uart_channel) {
        case UART_CHANNEL_1: usart_base = (volatile uint32_t *)USART1_BASE_ADDR; break;
        case UART_CHANNEL_2: usart_base = (volatile uint32_t *)USART2_BASE_ADDR; break;
        case UART_CHANNEL_6: usart_base = (volatile uint32_t *)USART6_BASE_ADDR; break;
        default: return; // Invalid channel
    }
    WDT_Reset();

    if (usart_base != NULL) {
        REG_ACCESS(usart_base + USART_CR1_OFFSET) &= ~(1U << 13); // Clear UE bit
        // Also disable peripheral clock to save power
        switch (uart_channel) {
            case UART_CHANNEL_1: REG_ACCESS(RCC_APB2ENR_ADDR) &= ~(1U << RCC_APB2ENR_USART1EN_Pos); break;
            case UART_CHANNEL_2: REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_USART2EN_Pos); break;
            case UART_CHANNEL_6: REG_ACCESS(RCC_APB2ENR_ADDR) &= ~(1U << RCC_APB2ENR_USART6EN_Pos); break;
            default: break;
        }
    }
}

/**
 * @brief Sends a single byte over the specified UART channel.
 * @param uart_channel The UART channel to use.
 * @param byte The byte to send.
 */
void UART_send_byte(t_uart_channel uart_channel, tbyte byte) {
    WDT_Reset();
    volatile uint32_t *usart_base = NULL;

    switch (uart_channel) {
        case UART_CHANNEL_1: usart_base = (volatile uint32_t *)USART1_BASE_ADDR; break;
        case UART_CHANNEL_2: usart_base = (volatile uint32_t *)USART2_BASE_ADDR; break;
        case UART_CHANNEL_6: usart_base = (volatile uint32_t *)USART6_BASE_ADDR; break;
        default: return; // Invalid channel
    }
    WDT_Reset();

    if (usart_base != NULL) {
        while (!(REG_ACCESS(usart_base + USART_SR_OFFSET) & (1U << 7))) { /* Wait for TXE flag */ } // TXE: Transmit data register empty
        REG_ACCESS(usart_base + USART_DR_OFFSET) = byte;
        while (!(REG_ACCESS(usart_base + USART_SR_OFFSET) & (1U << 6))) { /* Wait for TC flag */ }  // TC: Transmission complete
    }
}

/**
 * @brief Sends a frame of data over the specified UART channel.
 * @param uart_channel The UART channel to use.
 * @param data Pointer to the data buffer.
 * @param length The length of the data frame.
 */
void UART_send_frame(t_uart_channel uart_channel, const char *data, int length) {
    WDT_Reset();
    for (int i = 0; i < length; i++) {
        UART_send_byte(uart_channel, (tbyte)data[i]);
    }
}

/**
 * @brief Sends a null-terminated string over the specified UART channel.
 * @param uart_channel The UART channel to use.
 * @param str Pointer to the null-terminated string.
 */
void UART_send_string(t_uart_channel uart_channel, const char *str) {
    WDT_Reset();
    while (*str != '\0') {
        UART_send_byte(uart_channel, (tbyte)*str++);
    }
}

/**
 * @brief Receives a single byte from the specified UART channel.
 * @param uart_channel The UART channel to use.
 * @return The received byte.
 */
tbyte UART_Get_Byte(t_uart_channel uart_channel) {
    WDT_Reset();
    volatile uint32_t *usart_base = NULL;
    tbyte received_byte = 0;

    switch (uart_channel) {
        case UART_CHANNEL_1: usart_base = (volatile uint32_t *)USART1_BASE_ADDR; break;
        case UART_CHANNEL_2: usart_base = (volatile uint32_t *)USART2_BASE_ADDR; break;
        case UART_CHANNEL_6: usart_base = (volatile uint32_t *)USART6_BASE_ADDR; break;
        default: return 0; // Invalid channel
    }
    WDT_Reset();

    if (usart_base != NULL) {
        while (!(REG_ACCESS(usart_base + USART_SR_OFFSET) & (1U << 5))) { /* Wait for RXNE flag */ } // RXNE: Read data register not empty
        received_byte = (tbyte)(REG_ACCESS(usart_base + USART_DR_OFFSET) & 0xFF);
    }
    return received_byte;
}

/**
 * @brief Receives a frame of data from the specified UART channel.
 * @param uart_channel The UART channel to use.
 * @param buffer Pointer to the buffer to store received data.
 * @param max_length The maximum length of data to receive.
 */
void UART_Get_frame(t_uart_channel uart_channel, char *buffer, int max_length) {
    WDT_Reset();
    for (int i = 0; i < max_length; i++) {
        buffer[i] = (char)UART_Get_Byte(uart_channel);
    }
}

/**
 * @brief Receives a null-terminated string from the specified UART channel.
 * @param uart_channel The UART channel to use.
 * @param buffer Pointer to the buffer to store the received string.
 * @param max_length The maximum length of the string to receive (including null terminator).
 * @return The number of bytes read (excluding null terminator).
 */
tbyte UART_Get_string(t_uart_channel uart_channel, char *buffer, int max_length) {
    WDT_Reset();
    int i = 0;
    for (i = 0; i < max_length - 1; i++) {
        char received_char = (char)UART_Get_Byte(uart_channel);
        buffer[i] = received_char;
        if (received_char == '\n' || received_char == '\r') { // Example termination characters
            break;
        }
    }
    buffer[i] = '\0'; // Null-terminate the string
    return i;
}

// I2C APIs
/**
 * @brief Initializes a specified I2C channel with the given parameters.
 * @param i2c_channel The I2C channel to initialize (e.g., I2C_CHANNEL_1).
 * @param i2c_clk_speed The desired clock speed (e.g., I2C_CLK_SPEED_FAST).
 * @param i2c_device_address The device's own 7-bit address.
 * @param i2c_ack Acknowledgment control (enable/disable).
 * @param i2c_datalength The data length (not directly used by I2C hardware, but for API consistency).
 *
 * I2C Rules Applied:
 * - Addressing Mode equals Device Address
 * - Always use fast mode
 * - Always use maximum timeout (implied by blocking wait loops)
 * - Always generate a repeated start condition instead of stop between transactions (handled in send/get frame functions)
 */
void I2C_Init(t_i2c_channel i2c_channel, t_i2c_clk_speed i2c_clk_speed, t_i2c_device_address i2c_device_address, t_i2c_ack i2c_ack, t_i2c_datalength i2c_datalength) {
    WDT_Reset();
    volatile uint32_t *i2c_base = NULL;
    uint32_t pclk_freq = 16000000; // Assuming APB1 clock (PCLK1) is 16MHz for I2C1/2/3

    switch (i2c_channel) {
        case I2C_CHANNEL_1:
            i2c_base = (volatile uint32_t *)I2C1_BASE_ADDR;
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_I2C1EN_Pos); // Inferred: RCC_APB1ENR bit 21
            break;
        case I2C_CHANNEL_2:
            i2c_base = (volatile uint32_t *)I2C2_BASE_ADDR;
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_I2C2EN_Pos); // Inferred: RCC_APB1ENR bit 22
            break;
        case I2C_CHANNEL_3:
            i2c_base = (volatile uint32_t *)I2C3_BASE_ADDR;
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_I2C3EN_Pos); // Inferred: RCC_APB1ENR bit 23
            break;
        default:
            return; // Invalid channel
    }
    WDT_Reset();

    // Reset I2C peripheral (PE=0 then PE=1)
    REG_ACCESS(i2c_base + I2C_CR1_OFFSET) |= (1U << 15); // SWRST bit
    REG_ACCESS(i2c_base + I2C_CR1_OFFSET) &= ~(1U << 15); // Clear SWRST
    WDT_Reset();

    // Disable peripheral to configure
    REG_ACCESS(i2c_base + I2C_CR1_OFFSET) &= ~(1U << 0); // Clear PE bit

    // Configure CR2: Peripheral clock frequency
    REG_ACCESS(i2c_base + I2C_CR2_OFFSET) = (pclk_freq / 1000000); // Freq[5:0] bits
    WDT_Reset();

