ELARABY-AI-Team/Main_Generator/MCAL_C_Files/STM32F401RC_MCAL.c
    // Configure CCR: Clock control register (Fast mode, 400kHz)
    uint32_t ccr_val = 0;
    if (i2c_clk_speed == I2C_CLK_SPEED_FAST) {
        // Fast mode (F/S = 1, DUTY = 0 for 2)
        // Thigh = CCR * Tpclk, Tlow = 2 * CCR * Tpclk
        // T_fast_mode = (Thigh + Tlow) = 3 * CCR * Tpclk
        // F_fast_mode = PCLK1 / (3 * CCR) => CCR = PCLK1 / (3 * F_fast_mode)
        // For 400kHz, PCLK1=16MHz: CCR = 16MHz / (3 * 400kHz) = 16000 / 1200 = 13.33 -> 14
        ccr_val = pclk_freq / (3 * 400000); // Fast Mode, DUTY=0 (Tlow/Thigh=2)
        ccr_val |= (1U << 15); // F/S bit for Fast Mode
    } else { // I2C_CLK_SPEED_STANDARD (100kHz)
        // Standard mode (F/S = 0)
        // T_std_mode = 2 * CCR * Tpclk
        // F_std_mode = PCLK1 / (2 * CCR) => CCR = PCLK1 / (2 * F_std_mode)
        // For 100kHz, PCLK1=16MHz: CCR = 16MHz / (2 * 100kHz) = 16000 / 200 = 80
        ccr_val = pclk_freq / (2 * 100000);
    }
    REG_ACCESS(i2c_base + I2C_CCR_OFFSET) = ccr_val;
    WDT_Reset();

    // Configure TRISE: Max rise time
    // For 16MHz PCLK, Fast mode 400kHz: TRISE = (16MHz * 300ns / 1000ns) + 1 = 4.8+1 = 5.8 -> 6
    // For 16MHz PCLK, Standard mode 100kHz: TRISE = (16MHz * 1000ns / 1000ns) + 1 = 16+1 = 17
    REG_ACCESS(i2c_base + I2C_TRISE_OFFSET) = (pclk_freq / 1000000 * 300 / 1000) + 1; // Approx for 300ns fast mode
    WDT_Reset();

    // Configure OAR1: Own address (7-bit addressing, shift left by 1)
    REG_ACCESS(i2c_base + I2C_OAR1_OFFSET) = (i2c_device_address << 1) | (1U << 14); // Bit 14 must be kept at 1
    WDT_Reset();

    // Configure CR1: Acknowledge enable
    REG_ACCESS(i2c_base + I2C_CR1_OFFSET) |= (i2c_ack == I2C_ACK_ENABLE) ? (1U << 10) : 0; // ACK bit
    WDT_Reset();

    // Enable I2C peripheral
    REG_ACCESS(i2c_base + I2C_CR1_OFFSET) |= (1U << 0); // Set PE bit
}

/**
 * @brief Enables a specified I2C channel.
 * @param i2c_channel The I2C channel to enable.
 */
void I2C_Enable(t_i2c_channel i2c_channel) {
    WDT_Reset();
    volatile uint32_t *i2c_base = NULL;

    switch (i2c_channel) {
        case I2C_CHANNEL_1:
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_I2C1EN_Pos); // Enable peripheral clock (inferred)
            i2c_base = (volatile uint32_t *)I2C1_BASE_ADDR;
            break;
        case I2C_CHANNEL_2:
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_I2C2EN_Pos); // Enable peripheral clock (inferred)
            i2c_base = (volatile uint32_t *)I2C2_BASE_ADDR;
            break;
        case I2C_CHANNEL_3:
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_I2C3EN_Pos); // Enable peripheral clock (inferred)
            i2c_base = (volatile uint32_t *)I2C3_BASE_ADDR;
            break;
        default:
            return; // Invalid channel
    }
    WDT_Reset(); // Call WDT_Reset before setting the enable bit.

    if (i2c_base != NULL) {
        REG_ACCESS(i2c_base + I2C_CR1_OFFSET) |= (1U << 0); // Set PE bit
    }
}

/**
 * @brief Disables a specified I2C channel.
 * @param i2c_channel The I2C channel to disable.
 */
void I2C_Disable(t_i2c_channel i2c_channel) {
    WDT_Reset();
    volatile uint32_t *i2c_base = NULL;

    switch (i2c_channel) {
        case I2C_CHANNEL_1: i2c_base = (volatile uint32_t *)I2C1_BASE_ADDR; break;
        case I2C_CHANNEL_2: i2c_base = (volatile uint32_t *)I2C2_BASE_ADDR; break;
        case I2C_CHANNEL_3: i2c_base = (volatile uint32_t *)I2C3_BASE_ADDR; break;
        default: return; // Invalid channel
    }
    WDT_Reset();

    if (i2c_base != NULL) {
        REG_ACCESS(i2c_base + I2C_CR1_OFFSET) &= ~(1U << 0); // Clear PE bit
        // Also disable peripheral clock to save power
        switch (i2c_channel) {
            case I2C_CHANNEL_1: REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_I2C1EN_Pos); break;
            case I2C_CHANNEL_2: REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_I2C2EN_Pos); break;
            case I2C_CHANNEL_3: REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_I2C3EN_Pos); break;
            default: break;
        }
    }
}

/**
 * @brief Sends a single byte over the specified I2C channel.
 * @param i2c_channel The I2C channel to use.
 * @param byte The byte to send.
 */
void I2C_send_byte(t_i2c_channel i2c_channel, tbyte byte) {
    WDT_Reset();
    volatile uint32_t *i2c_base = NULL;

    switch (i2c_channel) {
        case I2C_CHANNEL_1: i2c_base = (volatile uint32_t *)I2C1_BASE_ADDR; break;
        case I2C_CHANNEL_2: i2c_base = (volatile uint32_t *)I2C2_BASE_ADDR; break;
        case I2C_CHANNEL_3: i2c_base = (volatile uint32_t *)I2C3_BASE_ADDR; break;
        default: return; // Invalid channel
    }
    WDT_Reset();

    if (i2c_base != NULL) {
        // Wait for TxE (Transmit Empty) flag to be set
        while (!(REG_ACCESS(i2c_base + I2C_SR1_OFFSET) & (1U << 7))) { /* max timeout implied */ }
        REG_ACCESS(i2c_base + I2C_DR_OFFSET) = byte;
    }
}

/**
 * @brief Sends a frame of data over the specified I2C channel.
 * @param i2c_channel The I2C channel to use.
 * @param data Pointer to the data buffer.
 * @param length The length of the data frame.
 */
void I2C_send_frame(t_i2c_channel i2c_channel, const char *data, int length) {
    WDT_Reset();
    volatile uint32_t *i2c_base = NULL;

    switch (i2c_channel) {
        case I2C_CHANNEL_1: i2c_base = (volatile uint32_t *)I2C1_BASE_ADDR; break;
        case I2C_CHANNEL_2: i2c_base = (volatile uint32_t *)I2C2_BASE_ADDR; break;
        case I2C_CHANNEL_3: i2c_base = (volatile uint32_t *)I2C3_BASE_ADDR; break;
        default: return; // Invalid channel
    }
    WDT_Reset();

    if (i2c_base != NULL) {
        // Generate Start condition
        REG_ACCESS(i2c_base + I2C_CR1_OFFSET) |= (1U << 8); // START bit
        while (!(REG_ACCESS(i2c_base + I2C_SR1_OFFSET) & (1U << 0))) { /* Wait for SB (Start Bit) */ }

        // Send Slave Address (write)
        REG_ACCESS(i2c_base + I2C_DR_OFFSET) = (tbyte)((I2C_ADDRESS_UNKNOWN << 1) & 0xFE); // Assuming a known address or it's implicitly handled later
        while (!(REG_ACCESS(i2c_base + I2C_SR1_OFFSET) & (1U << 1))) { /* Wait for ADDR */ }
        (void)REG_ACCESS(i2c_base + I2C_SR2_OFFSET); // Clear ADDR by reading SR2

        for (int i = 0; i < length; i++) {
            I2C_send_byte(i2c_channel, (tbyte)data[i]);
        }

        // Generate Stop condition if it's the end of a transaction
        // (Rules state "generate a repeated start condition instead of stop between transactions".
        // This implies for the *final* transaction, a stop is needed)
        REG_ACCESS(i2c_base + I2C_CR1_OFFSET) |= (1U << 9); // STOP bit
        while ((REG_ACCESS(i2c_base + I2C_CR1_OFFSET) & (1U << 9))) { /* Wait for STOPF */ }
    }
}

/**
 * @brief Sends a null-terminated string over the specified I2C channel.
 * @param i2c_channel The I2C channel to use.
 * @param str Pointer to the null-terminated string.
 */
void I2C_send_string(t_i2c_channel i2c_channel, const char *str) {
    WDT_Reset();
    I2C_send_frame(i2c_channel, str, strlen(str));
}

/**
 * @brief Receives a single byte from the specified I2C channel.
 * @param i2c_channel The I2C channel to use.
 * @return The received byte.
 */
tbyte I2C_Get_Byte(t_i2c_channel i2c_channel) {
    WDT_Reset();
    volatile uint32_t *i2c_base = NULL;
    tbyte received_byte = 0;

    switch (i2c_channel) {
        case I2C_CHANNEL_1: i2c_base = (volatile uint32_t *)I2C1_BASE_ADDR; break;
        case I2C_CHANNEL_2: i2c_base = (volatile uint32_t *)I2C2_BASE_ADDR; break;
        case I2C_CHANNEL_3: i2c_base = (volatile uint32_t *)I2C3_BASE_ADDR; break;
        default: return 0; // Invalid channel
    }
    WDT_Reset();

