ELARABY-AI-Team/Main_Generator/MCAL_C_Files/STM32F401RC_MCAL.c
    if (i2c_base != NULL) {
        // Wait for RxNE (Receive data register not empty) flag to be set
        while (!(REG_ACCESS(i2c_base + I2C_SR1_OFFSET) & (1U << 6))) { /* max timeout implied */ }
        received_byte = (tbyte)REG_ACCESS(i2c_base + I2C_DR_OFFSET);
    }
    return received_byte;
}

/**
 * @brief Receives a frame of data from the specified I2C channel.
 * @param i2c_channel The I2C channel to use.
 * @param buffer Pointer to the buffer to store received data.
 * @param max_length The maximum length of data to receive.
 */
void I2C_Get_frame(t_i2c_channel i2c_channel, char *buffer, int max_length) {
    WDT_Reset();
    volatile uint32_t *i2c_base = NULL;

    switch (i2c_channel) {
        case I2C_CHANNEL_1: i2c_base = (volatile uint32_t *)I2C1_BASE_ADDR; break;
        case I2C_CHANNEL_2: i2c_base = (volatile uint32_t *)I2C2_BASE_ADDR; break;
        case I2C_CHANNEL_3: i2c_base = (volatile uint32_t *)I2C3_BASE_ADDR; break;
        default: return; // Invalid channel
    }
    WDT_Reset();

    if (i2c_base != NULL) {
        // Generate Start condition
        REG_ACCESS(i2c_base + I2C_CR1_OFFSET) |= (1U << 8); // START bit
        while (!(REG_ACCESS(i2c_base + I2C_SR1_OFFSET) & (1U << 0))) { /* Wait for SB (Start Bit) */ }

        // Send Slave Address (read)
        REG_ACCESS(i2c_base + I2C_DR_OFFSET) = (tbyte)((I2C_ADDRESS_UNKNOWN << 1) | 0x01); // Assuming a known address or it's implicitly handled later
        while (!(REG_ACCESS(i2c_base + I2C_SR1_OFFSET) & (1U << 1))) { /* Wait for ADDR */ }
        (void)REG_ACCESS(i2c_base + I2C_SR2_OFFSET); // Clear ADDR by reading SR2

        for (int i = 0; i < max_length; i++) {
            if (i == max_length - 1) { // NACK on last byte
                REG_ACCESS(i2c_base + I2C_CR1_OFFSET) &= ~(1U << 10); // Clear ACK bit
            }
            buffer[i] = (char)I2C_Get_Byte(i2c_channel);
        }

        // Generate Stop condition
        REG_ACCESS(i2c_base + I2C_CR1_OFFSET) |= (1U << 9); // STOP bit
        while ((REG_ACCESS(i2c_base + I2C_CR1_OFFSET) & (1U << 9))) { /* Wait for STOPF */ }
    }
}

/**
 * @brief Receives a null-terminated string from the specified I2C channel.
 * @param i2c_channel The I2C channel to use.
 * @param buffer Pointer to the buffer to store the received string.
 * @param max_length The maximum length of the string to receive (including null terminator).
 * @return The number of bytes read (excluding null terminator).
 */
tbyte I2C_Get_string(t_i2c_channel i2c_channel, char *buffer, int max_length) {
    WDT_Reset();
    int i = 0;
    for (i = 0; i < max_length - 1; i++) {
        char received_char = (char)I2C_Get_Byte(i2c_channel);
        buffer[i] = received_char;
        if (received_char == '\0' || received_char == '\n' || received_char == '\r') {
            break;
        }
    }
    buffer[i] = '\0'; // Null-terminate the string
    return i;
}

// SPI (CSI) APIs
/**
 * @brief Initializes a specified SPI channel.
 * @param spi_channel The SPI channel to initialize (e.g., SPI_CHANNEL_1).
 * @param spi_mode The SPI mode (Master/Slave).
 * @param spi_cpol Clock polarity.
 * @param spi_cpha Clock phase.
 * @param spi_dff Data frame format (8-bit or 16-bit).
 * @param spi_bit_order Bit order (MSB first or LSB first).
 *
 * SPI Rules Applied:
 * - Always use fast speed (handled by prescaler calc)
 * - Slave Select always software-controlled (SSM=1, SSI=1)
 * - Always use full duplex (BIDIMODE=0)
 * - Always enable CRC (CRCEN=1)
 */
void spi_Init(t_spi_channel spi_channel, t_spi_mode spi_mode, t_spi_cpol spi_cpol, t_spi_cpha spi_cpha, t_spi_dff spi_dff, t_spi_bit_order spi_bit_order) {
    WDT_Reset();
    volatile uint32_t *spi_base = NULL;
    uint32_t pclk_freq = 16000000; // Assuming PCLK2 for SPI1 (16MHz), PCLK1 for SPI2/3 (16MHz)

    switch (spi_channel) {
        case SPI_CHANNEL_1:
            spi_base = (volatile uint32_t *)SPI1_BASE_ADDR;
            REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_SPI1EN_Pos); // Inferred: RCC_APB2ENR bit 12
            pclk_freq = 16000000; // Assuming APB2 clock
            break;
        case SPI_CHANNEL_2:
            spi_base = (volatile uint32_t *)SPI2_BASE_ADDR;
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_SPI2EN_Pos); // Inferred: RCC_APB1ENR bit 14
            pclk_freq = 16000000; // Assuming APB1 clock
            break;
        case SPI_CHANNEL_3:
            spi_base = (volatile uint32_t *)SPI3_BASE_ADDR;
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_SPI3EN_Pos); // Inferred: RCC_APB1ENR bit 15
            pclk_freq = 16000000; // Assuming APB1 clock
            break;
        default:
            return; // Invalid channel
    }
    WDT_Reset();

    // Disable SPI before configuration
    REG_ACCESS(spi_base + SPI_CR1_OFFSET) &= ~(1U << 6); // Clear SPE bit

    uint32_t cr1_val = 0;

    // Baud rate prescaler for "fast speed" - use PCLK/2
    cr1_val |= (0U << 3); // BR[2:0] = 000 (PCLK / 2)

    // CPOL, CPHA
    cr1_val |= (spi_cpol == SPI_CPOL_HIGH) ? (1U << 1) : 0;
    cr1_val |= (spi_cpha == SPI_CPHA_2_EDGE) ? (1U << 0) : 0;

    // Master/Slave Mode
    cr1_val |= (spi_mode == SPI_MODE_MASTER) ? (1U << 2) : 0; // MSTR bit

    // Data Frame Format (DFF)
    cr1_val |= (spi_dff == SPI_DFF_16_BIT) ? (1U << 11) : 0;

    // Bit Order (LSBFIRST)
    cr1_val |= (spi_bit_order == SPI_BIT_ORDER_LSB) ? (1U << 7) : 0;

    // Always use full duplex (BIDIMODE = 0) - default state

    // Always enable CRC
    cr1_val |= (1U << 13); // CRCEN bit
    REG_ACCESS(spi_base + SPI_CRCPR_OFFSET) = 7; // Default polynomial for CRC (e.g., 0x7)
    WDT_Reset();

    // Software Slave Management and Internal Slave Select
    cr1_val |= (1U << 9); // SSM (Software slave management) enable
    cr1_val |= (1U << 8); // SSI (Internal slave select) high

    REG_ACCESS(spi_base + SPI_CR1_OFFSET) = cr1_val;
    WDT_Reset();

    // CR2 (leave as default for basic init)
    REG_ACCESS(spi_base + SPI_CR2_OFFSET) = 0;
    WDT_Reset();

    // Enable SPI peripheral
    REG_ACCESS(spi_base + SPI_CR1_OFFSET) |= (1U << 6); // Set SPE bit
}

/**
 * @brief Enables a specified SPI channel.
 * @param spi_channel The SPI channel to enable.
 */
void SPI_Enable(t_spi_channel spi_channel) {
    WDT_Reset();
    volatile uint32_t *spi_base = NULL;

    switch (spi_channel) {
        case SPI_CHANNEL_1:
            REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_SPI1EN_Pos); // Enable peripheral clock (inferred)
            spi_base = (volatile uint32_t *)SPI1_BASE_ADDR;
            break;
        case SPI_CHANNEL_2:
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_SPI2EN_Pos); // Enable peripheral clock (inferred)
            spi_base = (volatile uint32_t *)SPI2_BASE_ADDR;
            break;
        case SPI_CHANNEL_3:
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_SPI3EN_Pos); // Enable peripheral clock (inferred)
            spi_base = (volatile uint32_t *)SPI3_BASE_ADDR;
            break;
        default:
            return; // Invalid channel
    }
    WDT_Reset(); // Call WDT_Reset before setting the enable bit.

