ELARABY-AI-Team/Main_Generator/MCAL_C_Files/STM32F401RC_MCAL.c
    if (spi_base != NULL) {
        REG_ACCESS(spi_base + SPI_CR1_OFFSET) |= (1U << 6); // Set SPE bit
    }
}

/**
 * @brief Disables a specified SPI channel.
 * @param spi_channel The SPI channel to disable.
 */
void SPI_Disable(t_spi_channel spi_channel) {
    WDT_Reset();
    volatile uint32_t *spi_base = NULL;

    switch (spi_channel) {
        case SPI_CHANNEL_1: spi_base = (volatile uint32_t *)SPI1_BASE_ADDR; break;
        case SPI_CHANNEL_2: spi_base = (volatile uint32_t *)SPI2_BASE_ADDR; break;
        case SPI_CHANNEL_3: spi_base = (volatile uint32_t *)SPI3_BASE_ADDR; break;
        default: return; // Invalid channel
    }
    WDT_Reset();

    if (spi_base != NULL) {
        REG_ACCESS(spi_base + SPI_CR1_OFFSET) &= ~(1U << 6); // Clear SPE bit
        // Also disable peripheral clock to save power
        switch (spi_channel) {
            case SPI_CHANNEL_1: REG_ACCESS(RCC_APB2ENR_ADDR) &= ~(1U << RCC_APB2ENR_SPI1EN_Pos); break;
            case SPI_CHANNEL_2: REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_SPI2EN_Pos); break;
            case SPI_CHANNEL_3: REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_SPI3EN_Pos); break;
            default: break;
        }
    }
}

/**
 * @brief Sends a single byte over the specified SPI channel.
 * @param spi_channel The SPI channel to use.
 * @param byte The byte to send.
 */
void SPI_Send_Byte(t_spi_channel spi_channel, tbyte byte) {
    WDT_Reset();
    volatile uint32_t *spi_base = NULL;

    switch (spi_channel) {
        case SPI_CHANNEL_1: spi_base = (volatile uint32_t *)SPI1_BASE_ADDR; break;
        case SPI_CHANNEL_2: spi_base = (volatile uint32_t *)SPI2_BASE_ADDR; break;
        case SPI_CHANNEL_3: spi_base = (volatile uint32_t *)SPI3_BASE_ADDR; break;
        default: return; // Invalid channel
    }
    WDT_Reset();

    if (spi_base != NULL) {
        while (!(REG_ACCESS(spi_base + SPI_SR_OFFSET) & (1U << 1))) { /* Wait for TXE flag */ } // TXE: Transmit buffer empty
        REG_ACCESS(spi_base + SPI_DR_OFFSET) = byte;
        while (REG_ACCESS(spi_base + SPI_SR_OFFSET) & (1U << 7)) { /* Wait for BSY flag to clear (transmission complete) */ } // BSY: Busy flag
    }
}

/**
 * @brief Sends a frame of data over the specified SPI channel.
 * @param spi_channel The SPI channel to use.
 * @param data Pointer to the data buffer.
 * @param length The length of the data frame.
 */
void SPI_send_frame(t_spi_channel spi_channel, const char *data, int length) {
    WDT_Reset();
    for (int i = 0; i < length; i++) {
        SPI_Send_Byte(spi_channel, (tbyte)data[i]);
    }
}

/**
 * @brief Receives a single byte from the specified SPI channel.
 * @param spi_channel The SPI channel to use.
 * @return The received byte.
 */
tbyte SPI_Get_Byte(t_spi_channel spi_channel) {
    WDT_Reset();
    volatile uint32_t *spi_base = NULL;
    tbyte received_byte = 0;

    switch (spi_channel) {
        case SPI_CHANNEL_1: spi_base = (volatile uint32_t *)SPI1_BASE_ADDR; break;
        case SPI_CHANNEL_2: spi_base = (volatile uint32_t *)SPI2_BASE_ADDR; break;
        case SPI_CHANNEL_3: spi_base = (volatile uint32_t *)SPI3_BASE_ADDR; break;
        default: return 0; // Invalid channel
    }
    WDT_Reset();

    if (spi_base != NULL) {
        // To read, typically you transmit a dummy byte to initiate clocking
        // Or if in slave mode, just wait for data
        REG_ACCESS(spi_base + SPI_DR_OFFSET) = 0xFF; // Send dummy byte to trigger reception
        while (!(REG_ACCESS(spi_base + SPI_SR_OFFSET) & (1U << 0))) { /* Wait for RXNE flag */ } // RXNE: Receive buffer not empty
        received_byte = (tbyte)REG_ACCESS(spi_base + SPI_DR_OFFSET);
    }
    return received_byte;
}

/**
 * @brief Receives a frame of data from the specified SPI channel.
 * @param spi_channel The SPI channel to use.
 * @param buffer Pointer to the buffer to store received data.
 * @param max_length The maximum length of data to receive.
 */
void SPI_Get_frame(t_spi_channel spi_channel, char *buffer, int max_length) {
    WDT_Reset();
    for (int i = 0; i < max_length; i++) {
        buffer[i] = (char)SPI_Get_Byte(spi_channel);
    }
}

/**
 * @brief Receives a null-terminated string from the specified SPI channel.
 * @param spi_channel The SPI channel to use.
 * @param buffer Pointer to the buffer to store the received string.
 * @param max_length The maximum length of the string to receive (including null terminator).
 * @return The number of bytes read (excluding null terminator).
 */
tbyte SPI_Get_string(t_spi_channel spi_channel, char *buffer, int max_length) {
    WDT_Reset();
    int i = 0;
    for (i = 0; i < max_length - 1; i++) {
        char received_char = (char)SPI_Get_Byte(spi_channel);
        buffer[i] = received_char;
        if (received_char == '\0') { // Check for null terminator
            break;
        }
    }
    buffer[i] = '\0'; // Null-terminate the string
    return i;
}

// External Interrupt APIs
/**
 * @brief Initializes an external interrupt channel.
 * @param external_int_channel The EXTI line (e.g., EXTI_LINE_0).
 * @param external_int_edge The trigger edge (Rising, Falling, Both).
 */
void External_INT_Init(t_external_int_channel external_int_channel, t_external_int_edge external_int_edge) {
    WDT_Reset();

    // Enable SYSCFG clock (inferred)
    REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_SYSCFGEN_Pos); // Inferred: RCC_APB2ENR bit 14
    WDT_Reset();

    // Map EXTI line to SYSCFG_EXTICR register and bit
    uint32_t exti_port_idx = (uint32_t)external_int_channel / 4; // EXTI0-3 -> EXTICR1, EXTI4-7 -> EXTICR2, etc.
    uint32_t exti_pin_idx = (uint32_t)external_int_channel % 4;
    volatile uint32_t *exticr_reg_addr = NULL;

    switch (exti_port_idx) {
        case 0: exticr_reg_addr = (volatile uint32_t *)SYSCFG_EXTICR1_ADDR; break;
        case 1: exticr_reg_addr = (volatile uint32_t *)SYSCFG_EXTICR2_ADDR; break;
        case 2: exticr_reg_addr = (volatile uint32_t *)SYSCFG_EXTICR3_ADDR; break;
        case 3: exticr_reg_addr = (volatile uint32_t *)SYSCFG_EXTICR4_ADDR; break;
        default: return; // Invalid EXTI line
    }
    WDT_Reset();

    // Clear previous settings for the EXTI line source
    REG_ACCESS(exticr_reg_addr) &= ~(0xFUL << (exti_pin_idx * 4));
    // Set EXTI source to GPIOA (0x0000) for simplicity. In a real application, this would be passed in.
    // For this implementation, we assume GPIOA is the source for all EXTI lines by default, as it's the first option.
    REG_ACCESS(exticr_reg_addr) |= (0x0UL << (exti_pin_idx * 4)); // Assume GPIOA as default source

    // Configure trigger edge
    REG_ACCESS(EXTI_RTSR_ADDR) &= ~(1U << external_int_channel); // Clear Rising Trigger
    REG_ACCESS(EXTI_FTSR_ADDR) &= ~(1U << external_int_channel); // Clear Falling Trigger
    WDT_Reset();

    if (external_int_edge == EXTERNAL_INT_EDGE_RISING || external_int_edge == EXTERNAL_INT_EDGE_BOTH) {
        REG_ACCESS(EXTI_RTSR_ADDR) |= (1U << external_int_channel);
    }
    if (external_int_edge == EXTERNAL_INT_EDGE_FALLING || external_int_edge == EXTERNAL_INT_EDGE_BOTH) {
        REG_ACCESS(EXTI_FTSR_ADDR) |= (1U << external_int_channel);
    }
    WDT_Reset();

    // Clear pending flag for the EXTI line
    REG_ACCESS(EXTI_PR_ADDR) = (1U << external_int_channel); // Write 1 to clear
    WDT_Reset();
}

/**
 * @brief Enables an external interrupt channel.
 * @param external_int_channel The EXTI line to enable.
 */
void External_INT_Enable(t_external_int_channel external_int_channel) {
    WDT_Reset();
    REG_ACCESS(EXTI_IMR_ADDR) |= (1U << external_int_channel); // Set Interrupt Mask Register bit
    // Enable corresponding NVIC interrupt (inferred)
    // For EXTI0, EXTI1, ..., EXTI15, there are specific IRQs.
    // Grouped IRQs (EXTI0, EXTI1, EXTI2, EXTI3, EXTI4, EXTI9_5, EXTI15_10)
    IRQn_Type irqn;
    if (external_int_channel <= 4) { // EXTI0-EXTI4 have individual IRQs
        irqn = (IRQn_Type)(EXTI0_IRQn + external_int_channel);
    } else if (external_int_channel <= 9) { // EXTI5-9 map to EXTI9_5_IRQn
        irqn = EXTI9_5_IRQn;
    } else { // EXTI10-15 map to EXTI15_10_IRQn
        irqn = EXTI15_10_IRQn;
    }
    NVIC_EnableIRQ(irqn);
}

/**
 * @brief Disables an external interrupt channel.
 * @param external_int_channel The EXTI line to disable.
 */
void External_INT_Disable(t_external_int_channel external_int_channel) {
    WDT_Reset();
    REG_ACCESS(EXTI_IMR_ADDR) &= ~(1U << external_int_channel); // Clear Interrupt Mask Register bit
    // Disable corresponding NVIC interrupt (inferred)
    IRQn_Type irqn;
    if (external_int_channel <= 4) { // EXTI0-EXTI4 have individual IRQs
        irqn = (IRQn_Type)(EXTI0_IRQn + external_int_channel);
    } else if (external_int_channel <= 9) { // EXTI5-9 map to EXTI9_5_IRQn
        irqn = EXTI9_5_IRQn;
    } else { // EXTI10-15 map to EXTI15_10_IRQn
        irqn = EXTI15_10_IRQn;
    }
    NVIC_DisableIRQ(irqn);
}

// GPIO APIs
/**
 * @brief Initializes a GPIO pin as an output and sets its initial value.
 * @param port The GPIO port.
 * @param pin The pin number.
 * @param value The initial output value (0 or 1).
 */
void GPIO_Output_Init(t_port port, t_pin pin, tbyte value) {
    WDT_Reset();
    volatile uint32_t *gpio_base = get_gpio_port_base_addr(port);
    if (gpio_base == NULL) return;

    // Enable GPIO clock (inferred)
    REG_ACCESS(RCC_AHB1ENR_ADDR) |= (1U << (uint32_t)port); // Port A=0, B=1, ... H=7
    WDT_Reset();

    // 1. Set value before setting direction
    GPIO_Value_Set(port, pin, value);
    WDT_Reset();

    // 2. Set direction to output (01)
    REG_ACCESS(gpio_base + GPIO_MODER_OFFSET) &= ~(3U << (pin * 2)); // Clear mode bits
    REG_ACCESS(gpio_base + GPIO_MODER_OFFSET) |= (1U << (pin * 2));  // Set to General purpose output mode (01)
    WDT_Reset();
    // Verify MODER
    while (!((REG_ACCESS(gpio_base + GPIO_MODER_OFFSET) >> (pin * 2)) & 0x01U)) { /* Wait for mode to be set */ }

