ELARABY-AI-Team/Main_Generator/MCAL_C_Files/STM32F401RC_MCAL.c
    // All output pins have pull-up resistors disabled (00)
    REG_ACCESS(gpio_base + GPIO_PUPDR_OFFSET) &= ~(3U << (pin * 2)); // Clear pull-up/pull-down bits
    WDT_Reset();

    // For current registers: use >=20mA sink current & >=10mA source current
    // This is typically achieved by setting "very high speed" on STM32
    REG_ACCESS(gpio_base + GPIO_OSPEEDR_OFFSET) |= (3U << (pin * 2)); // Set to Very High speed (11)
    WDT_Reset();
}

/**
 * @brief Initializes a GPIO pin as an input.
 * @param port The GPIO port.
 * @param pin The pin number.
 */
void GPIO_Input_Init(t_port port, t_pin pin) {
    WDT_Reset();
    volatile uint32_t *gpio_base = get_gpio_port_base_addr(port);
    if (gpio_base == NULL) return;

    // Enable GPIO clock (inferred)
    REG_ACCESS(RCC_AHB1ENR_ADDR) |= (1U << (uint32_t)port); // Port A=0, B=1, ... H=7
    WDT_Reset();

    // Set direction to input (00)
    REG_ACCESS(gpio_base + GPIO_MODER_OFFSET) &= ~(3U << (pin * 2)); // Clear mode bits (00 for Input mode)
    WDT_Reset();
    // Verify MODER
    while ((REG_ACCESS(gpio_base + GPIO_MODER_OFFSET) >> (pin * 2)) & 0x03U) { /* Wait for mode to be set to input */ }

    // All input pins have pull-up resistors and wakeup feature enabled (if available)
    REG_ACCESS(gpio_base + GPIO_PUPDR_OFFSET) &= ~(3U << (pin * 2)); // Clear pull-up/pull-down bits
    REG_ACCESS(gpio_base + GPIO_PUPDR_OFFSET) |= (1U << (pin * 2));  // Set to Pull-up (01)
    WDT_Reset();
}

/**
 * @brief Gets the direction of a GPIO pin.
 * @param port The GPIO port.
 * @param pin The pin number.
 * @return The direction (INPUT or OUTPUT).
 */
t_direction GPIO_Direction_get(t_port port, t_pin pin) {
    WDT_Reset();
    volatile uint32_t *gpio_base = get_gpio_port_base_addr(port);
    if (gpio_base == NULL) return (t_direction)-1; // Invalid

    // Read mode bits (2 bits per pin)
    uint32_t moder_val = (REG_ACCESS(gpio_base + GPIO_MODER_OFFSET) >> (pin * 2)) & 0x03U;
    if (moder_val == 0x00U) {
        return INPUT;
    } else if (moder_val == 0x01U) {
        return OUTPUT;
    }
    return (t_direction)-1; // Not input or output (e.g., AF, Analog)
}

/**
 * @brief Sets the value of a GPIO output pin.
 * @param port The GPIO port.
 * @param pin The pin number.
 * @param value The value to set (0 for low, 1 for high).
 */
void GPIO_Value_Set(t_port port, t_pin pin, t_byte value) {
    WDT_Reset();
    volatile uint32_t *gpio_base = get_gpio_port_base_addr(port);
    if (gpio_base == NULL) return;

    if (value == 1) {
        REG_ACCESS(gpio_base + GPIO_BSRR_OFFSET) = (1UL << pin);       // Set bit (BSx)
    } else {
        REG_ACCESS(gpio_base + GPIO_BSRR_OFFSET) = (1UL << (pin + 16)); // Reset bit (BRx)
    }
    WDT_Reset();
    // Verify ODR
    while (((REG_ACCESS(gpio_base + GPIO_ODR_OFFSET) >> pin) & 0x01U) != value) { /* Wait for value to be set */ }
}

/**
 * @brief Gets the value of a GPIO input or output pin.
 * @param port The GPIO port.
 * @param pin The pin number.
 * @return The value of the pin (0 or 1).
 */
tbyte GPIO_Value_Get(t_port port, t_pin pin) {
    WDT_Reset();
    volatile uint32_t *gpio_base = get_gpio_port_base_addr(port);
    if (gpio_base == NULL) return 0xFF; // Invalid

    // Read input data register
    return (tbyte)((REG_ACCESS(gpio_base + GPIO_IDR_OFFSET) >> pin) & 0x01U);
}

/**
 * @brief Toggles the value of a GPIO output pin.
 * @param port The GPIO port.
 * @param pin The pin number.
 */
void GPIO_Value_Tog(t_port port, t_pin pin) {
    WDT_Reset();
    volatile uint32_t *gpio_base = get_gpio_port_base_addr(port);
    if (gpio_base == NULL) return;

    REG_ACCESS(gpio_base + GPIO_ODR_OFFSET) ^= (1UL << pin); // Toggle ODR bit
}

// PWM APIs
/**
 * @brief Initializes a specified PWM channel.
 * @param pwm_channel The PWM channel to initialize (e.g., PWM_CHANNEL_TIM1_CH1).
 * @param pwm_khz_freq The desired PWM frequency in KHz.
 * @param pwm_duty The desired PWM duty cycle (0-100%).
 *
 * Rule: Clear available FREQUENCY Ranges for each channel as comments in PWM_Init()
 * Timer 1, 9, 10, 11 are on APB2 bus (up to 84MHz)
 * Timer 2, 3, 4, 5 are on APB1 bus (up to 42MHz)
 * Max PWM freq depends on timer clock and resolution.
 * E.g., for 16-bit timer (65535 ARR), 84MHz clock: min freq = 84MHz/65535 ~ 1.28 kHz
 * For 42MHz clock: min freq = 42MHz/65535 ~ 0.64 kHz
 * Max freq is typically PCLK/2 or PCLK, depending on resolution needed.
 */
void PWM_Init(t_pwm_channel pwm_channel, tbyte pwm_khz_freq, tbyte pwm_duty) {
    WDT_Reset();
    volatile uint32_t *timer_base = get_timer_base_addr((t_timer_channel)pwm_channel);
    if (timer_base == NULL) return;

    uint32_t timer_clock_freq;
    tbyte timer_channel_idx = 0; // 0 for CH1, 1 for CH2, etc.
    uint32_t ccmr_offset; // CCMR1 or CCMR2
    uint32_t ccr_offset;  // CCR1, CCR2, etc.

    // Determine timer clock frequency and enable it
    switch (pwm_channel) {
        case PWM_CHANNEL_TIM1_CH1: // PA8, PE9
        case PWM_CHANNEL_TIM1_CH2: // PA9, PE11
        case PWM_CHANNEL_TIM1_CH3: // PA10, PE13
        case PWM_CHANNEL_TIM1_CH4: // PA11, PE14
            REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM1EN_Pos); // Infer: RCC_APB2ENR bit 0
            timer_clock_freq = 84000000; // Assuming APB2 timer clock at max 84MHz (PCLK2 * 2 if APB2 prescaler > 1)
            timer_channel_idx = (pwm_channel - PWM_CHANNEL_TIM1_CH1);
            ccmr_offset = (timer_channel_idx < 2) ? TIM_CCMR1_OFFSET : TIM_CCMR2_OFFSET;
            ccr_offset = TIM_CCR1_OFFSET + (timer_channel_idx * 4);
            break;
        case PWM_CHANNEL_TIM2_CH1: // PA0, PA5, PA15, PB3
        case PWM_CHANNEL_TIM2_CH2: // PA1, PB3, PB10
        case PWM_CHANNEL_TIM2_CH3: // PA2, PB10
        case PWM_CHANNEL_TIM2_CH4: // PA3, PB11
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM2EN_Pos); // Infer: RCC_APB1ENR bit 0
            timer_clock_freq = 42000000; // Assuming APB1 timer clock at max 42MHz (PCLK1 * 2 if APB1 prescaler > 1)
            timer_channel_idx = (pwm_channel - PWM_CHANNEL_TIM2_CH1);
            ccmr_offset = (timer_channel_idx < 2) ? TIM_CCMR1_OFFSET : TIM_CCMR2_OFFSET;
            ccr_offset = TIM_CCR1_OFFSET + (timer_channel_idx * 4);
            break;
        case PWM_CHANNEL_TIM3_CH1: // PA6, PB4, PC6
        case PWM_CHANNEL_TIM3_CH2: // PA7, PB5, PC7
        case PWM_CHANNEL_TIM3_CH3: // PB0, PC8
        case PWM_CHANNEL_TIM3_CH4: // PB1, PC9
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM3EN_Pos); // Infer: RCC_APB1ENR bit 1
            timer_clock_freq = 42000000; // Assuming APB1 timer clock at max 42MHz
            timer_channel_idx = (pwm_channel - PWM_CHANNEL_TIM3_CH1);
            ccmr_offset = (timer_channel_idx < 2) ? TIM_CCMR1_OFFSET : TIM_CCMR2_OFFSET;
            ccr_offset = TIM_CCR1_OFFSET + (timer_channel_idx * 4);
            break;
        case PWM_CHANNEL_TIM4_CH1: // PB6
        case PWM_CHANNEL_TIM4_CH2: // PB7
        case PWM_CHANNEL_TIM4_CH3: // PB8
        case PWM_CHANNEL_TIM4_CH4: // PB9
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM4EN_Pos); // Infer: RCC_APB1ENR bit 2
            timer_clock_freq = 42000000; // Assuming APB1 timer clock at max 42MHz
            timer_channel_idx = (pwm_channel - PWM_CHANNEL_TIM4_CH1);
            ccmr_offset = (timer_channel_idx < 2) ? TIM_CCMR1_OFFSET : TIM_CCMR2_OFFSET;
            ccr_offset = TIM_CCR1_OFFSET + (timer_channel_idx * 4);
            break;
        case PWM_CHANNEL_TIM5_CH1: // PA0
        case PWM_CHANNEL_TIM5_CH2: // PA1
        case PWM_CHANNEL_TIM5_CH3: // PA2
        case PWM_CHANNEL_TIM5_CH4: // PA3
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM5EN_Pos); // Infer: RCC_APB1ENR bit 3
            timer_clock_freq = 42000000; // Assuming APB1 timer clock at max 42MHz
            timer_channel_idx = (pwm_channel - PWM_CHANNEL_TIM5_CH1);
            ccmr_offset = (timer_channel_idx < 2) ? TIM_CCMR1_OFFSET : TIM_CCMR2_OFFSET;
            ccr_offset = TIM_CCR1_OFFSET + (timer_channel_idx * 4);
            break;
        case PWM_CHANNEL_TIM9_CH1: // PA2, PE5
        case PWM_CHANNEL_TIM9_CH2: // PA3, PE6
            REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM9EN_Pos); // Infer: RCC_APB2ENR bit 18
            timer_clock_freq = 84000000; // Assuming APB2 timer clock at max 84MHz
            timer_channel_idx = (pwm_channel - PWM_CHANNEL_TIM9_CH1);
            ccmr_offset = TIM_CCMR1_OFFSET;
            ccr_offset = TIM_CCR1_OFFSET + (timer_channel_idx * 4);
            break;
        case PWM_CHANNEL_TIM10_CH1: // PB8, PA6
            REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM10EN_Pos); // Infer: RCC_APB2ENR bit 17
            timer_clock_freq = 84000000; // Assuming APB2 timer clock at max 84MHz
            timer_channel_idx = 0;
            ccmr_offset = TIM_CCMR1_OFFSET;
            ccr_offset = TIM_CCR1_OFFSET;
            break;
        case PWM_CHANNEL_TIM11_CH1: // PB9, PA7
            REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM11EN_Pos); // Infer: RCC_APB2ENR bit 18 (same as TIM9 in some cases, verify datasheet)
            timer_clock_freq = 84000000; // Assuming APB2 timer clock at max 84MHz
            timer_channel_idx = 0;
            ccmr_offset = TIM_CCMR1_OFFSET;
            ccr_offset = TIM_CCR1_OFFSET;
            break;
        default: return; // Invalid channel
    }
    WDT_Reset();

