ELARABY-AI-Team/Main_Generator/MCAL_C_Files/STM32F401RC_MCAL.c
    // Disable timer before configuring
    REG_ACCESS(timer_base + TIM_CR1_OFFSET) &= ~(1U << 0); // Clear CEN bit

    // Calculate Prescaler (PSC) and Auto-Reload Register (ARR) for desired frequency
    // Target frequency = timer_clock_freq / ((PSC + 1) * (ARR + 1))
    // To achieve pwm_khz_freq, we choose an ARR and calculate PSC.
    // Max ARR for 16-bit timer is 65535.
    // Let ARR = Max ARR for max resolution (or a fixed value like 1000 for easier duty cycle)
    tword arr = 999; // Set ARR for 1kHz base frequency with appropriate prescaler, or higher for resolution
    tword psc = (timer_clock_freq / (pwm_khz_freq * 1000 * (arr + 1))) - 1;

    // Boundary check for PSC
    if (psc > 0xFFFF) psc = 0xFFFF;
    if (psc < 0) psc = 0; // Ensure non-negative

    REG_ACCESS(timer_base + TIM_PSC_OFFSET) = psc;
    REG_ACCESS(timer_base + TIM_ARR_OFFSET) = arr;
    WDT_Reset();

    // Configure Output Compare Mode (PWM mode 1)
    // Clear CCMR bits for current channel
    uint32_t ccmr_val = REG_ACCESS(timer_base + ccmr_offset);
    uint32_t ccmr_channel_pos = (timer_channel_idx % 2) * 8; // CC1/CC3 are bits 0-7, CC2/CC4 are bits 8-15

    ccmr_val &= ~(0xFFUL << ccmr_channel_pos); // Clear OCxM and OCxE bits
    ccmr_val |= (6U << (4 + ccmr_channel_pos)); // OCxM = 110 (PWM mode 1)
    ccmr_val |= (1U << (3 + ccmr_channel_pos)); // OCxPE (Output compare preload enable)
    REG_ACCESS(timer_base + ccmr_offset) = ccmr_val;
    WDT_Reset();

    // Set Capture/Compare Register (CCR) for duty cycle
    tword pulse_value = (tword)(((float)arr * pwm_duty) / 100.0f);
    REG_ACCESS(timer_base + ccr_offset) = pulse_value;
    WDT_Reset();

    // Enable Output Compare for selected channel in CCER
    REG_ACCESS(timer_base + TIM_CCER_OFFSET) |= (1U << (timer_channel_idx * 4)); // CCxE bit

    // Enable auto-reload preload enable
    REG_ACCESS(timer_base + TIM_CR1_OFFSET) |= (1U << 7); // ARPE bit

    // If advanced timer (TIM1), enable Main Output
    if (timer_base == (volatile uint32_t *)TIM1_BASE_ADDR) {
        REG_ACCESS(timer_base + TIM_BDTR_OFFSET) |= (1U << 15); // MOE bit
    }

    // Generate an update event to load the Prescaler and ARR values
    REG_ACCESS(timer_base + TIM_EGR_OFFSET) |= (1U << 0); // UG bit
    WDT_Reset();

    // Clear available FREQUENCY Ranges for each channel as comments
    // TIM1, TIM9, TIM10, TIM11 (APB2 Clock = 84MHz):
    // With ARR=999, PSC=0: Freq = 84MHz / (1 * 1000) = 84 kHz
    // With ARR=999, PSC=83: Freq = 84MHz / (84 * 1000) = 1 kHz
    // With ARR=65535, PSC=0: Freq = 84MHz / (1 * 65536) ~ 1.28 kHz
    // With ARR=65535, PSC=1279: Freq = 84MHz / (1280 * 65536) ~ 1 Hz
    //
    // TIM2, TIM3, TIM4, TIM5 (APB1 Clock = 42MHz):
    // With ARR=999, PSC=0: Freq = 42MHz / (1 * 1000) = 42 kHz
    // With ARR=999, PSC=41: Freq = 42MHz / (42 * 1000) = 1 kHz
    // With ARR=65535, PSC=0: Freq = 42MHz / (1 * 65536) ~ 0.64 kHz
    // With ARR=65535, PSC=639: Freq = 42MHz / (640 * 65536) ~ 1 Hz
}

/**
 * @brief Starts a specified PWM channel.
 * @param pwm_channel The PWM channel to start.
 */
void PWM_Strt(t_pwm_channel pwm_channel) {
    WDT_Reset();
    volatile uint32_t *timer_base = get_timer_base_addr((t_timer_channel)pwm_channel);
    if (timer_base == NULL) return;

    REG_ACCESS(timer_base + TIM_CR1_OFFSET) |= (1U << 0); // Set CEN bit (Counter Enable)
}

/**
 * @brief Stops a specified PWM channel.
 * @param pwm_channel The PWM channel to stop.
 */
void PWM_Stop(t_pwm_channel pwm_channel) {
    WDT_Reset();
    volatile uint32_t *timer_base = get_timer_base_addr((t_timer_channel)pwm_channel);
    if (timer_base == NULL) return;

    REG_ACCESS(timer_base + TIM_CR1_OFFSET) &= ~(1U << 0); // Clear CEN bit (Counter Enable)
}

// ICU (Input Capture Unit) APIs
static void (*icu_callback_ptr[16])(void) = {NULL}; // Array of function pointers for EXTI lines

/**
 * @brief Initializes an ICU channel.
 * @param icu_channel The ICU channel to initialize.
 * @param icu_prescaller The prescaler for the timer used by ICU.
 * @param icu_edge The edge to trigger capture (Rising, Falling, Both).
 */
void ICU_init(t_icu_channel icu_channel, t_icu_prescaller icu_prescaller, t_icu_edge icu_edge) {
    WDT_Reset();
    volatile uint32_t *timer_base = get_timer_base_addr((t_timer_channel)icu_channel);
    if (timer_base == NULL) return;

    uint32_t timer_channel_idx = 0; // 0 for CH1, 1 for CH2, etc.
    uint32_t ccmr_offset; // CCMR1 or CCMR2
    uint32_t ccr_offset;  // CCR1, CCR2, etc.
    t_external_int_channel exti_line = EXTI_LINE_UNKNOWN;

    // Determine timer clock frequency and enable it
    switch (icu_channel) {
        case ICU_CHANNEL_TIM1_CH1: REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM1EN_Pos); timer_channel_idx = 0; exti_line = EXTI_LINE_8; break;
        case ICU_CHANNEL_TIM1_CH2: REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM1EN_Pos); timer_channel_idx = 1; exti_line = EXTI_LINE_9; break;
        case ICU_CHANNEL_TIM1_CH3: REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM1EN_Pos); timer_channel_idx = 2; exti_line = EXTI_LINE_10; break;
        case ICU_CHANNEL_TIM1_CH4: REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM1EN_Pos); timer_channel_idx = 3; exti_line = EXTI_LINE_11; break;

        case ICU_CHANNEL_TIM2_CH1: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM2EN_Pos); timer_channel_idx = 0; exti_line = EXTI_LINE_0; break;
        case ICU_CHANNEL_TIM2_CH2: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM2EN_Pos); timer_channel_idx = 1; exti_line = EXTI_LINE_1; break;
        case ICU_CHANNEL_TIM2_CH3: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM2EN_Pos); timer_channel_idx = 2; exti_line = EXTI_LINE_2; break;
        case ICU_CHANNEL_TIM2_CH4: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM2EN_Pos); timer_channel_idx = 3; exti_line = EXTI_LINE_3; break;

        case ICU_CHANNEL_TIM3_CH1: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM3EN_Pos); timer_channel_idx = 0; exti_line = EXTI_LINE_6; break;
        case ICU_CHANNEL_TIM3_CH2: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM3EN_Pos); timer_channel_idx = 1; exti_line = EXTI_LINE_7; break;
        case ICU_CHANNEL_TIM3_CH3: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM3EN_Pos); timer_channel_idx = 2; exti_line = EXTI_LINE_0; break; // PB0
        case ICU_CHANNEL_TIM3_CH4: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM3EN_Pos); timer_channel_idx = 3; exti_line = EXTI_LINE_1; break; // PB1

        case ICU_CHANNEL_TIM4_CH1: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM4EN_Pos); timer_channel_idx = 0; exti_line = EXTI_LINE_6; break; // PB6
        case ICU_CHANNEL_TIM4_CH2: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM4EN_Pos); timer_channel_idx = 1; exti_line = EXTI_LINE_7; break; // PB7
        case ICU_CHANNEL_TIM4_CH3: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM4EN_Pos); timer_channel_idx = 2; exti_line = EXTI_LINE_8; break; // PB8
        case ICU_CHANNEL_TIM4_CH4: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM4EN_Pos); timer_channel_idx = 3; exti_line = EXTI_LINE_9; break; // PB9

        case ICU_CHANNEL_TIM5_CH1: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM5EN_Pos); timer_channel_idx = 0; exti_line = EXTI_LINE_0; break; // PA0
        case ICU_CHANNEL_TIM5_CH2: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM5EN_Pos); timer_channel_idx = 1; exti_line = EXTI_LINE_1; break; // PA1
        case ICU_CHANNEL_TIM5_CH3: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM5EN_Pos); timer_channel_idx = 2; exti_line = EXTI_LINE_2; break; // PA2
        case ICU_CHANNEL_TIM5_CH4: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM5EN_Pos); timer_channel_idx = 3; exti_line = EXTI_LINE_3; break; // PA3

        case ICU_CHANNEL_TIM9_CH1: REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM9EN_Pos); timer_channel_idx = 0; exti_line = EXTI_LINE_2; break; // PA2
        case ICU_CHANNEL_TIM9_CH2: REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM9EN_Pos); timer_channel_idx = 1; exti_line = EXTI_LINE_3; break; // PA3

