ELARABY-AI-Team/Main_Generator/MCAL_C_Files/STM32F401RC_MCAL.c
        case ICU_CHANNEL_TIM10_CH1: REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM10EN_Pos); timer_channel_idx = 0; exti_line = EXTI_LINE_6; break; // PA6

        case ICU_CHANNEL_TIM11_CH1: REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM11EN_Pos); timer_channel_idx = 0; exti_line = EXTI_LINE_7; break; // PA7

        default: return; // Invalid channel
    }
    WDT_Reset();

    ccmr_offset = (timer_channel_idx < 2) ? TIM_CCMR1_OFFSET : TIM_CCMR2_OFFSET;
    ccr_offset = TIM_CCR1_OFFSET + (timer_channel_idx * 4);
    uint32_t ccmr_channel_pos = (timer_channel_idx % 2) * 8; // CC1/CC3 are bits 0-7, CC2/CC4 are bits 8-15

    // Disable timer before configuring
    REG_ACCESS(timer_base + TIM_CR1_OFFSET) &= ~(1U << 0); // Clear CEN bit

    // Configure Prescaler
    REG_ACCESS(timer_base + TIM_PSC_OFFSET) = icu_prescaller;
    REG_ACCESS(timer_base + TIM_ARR_OFFSET) = 0xFFFF; // Max auto-reload value for free-running counter
    WDT_Reset();

    // Configure CCMR for Input Capture mode
    uint32_t ccmr_val = REG_ACCESS(timer_base + ccmr_offset);
    ccmr_val &= ~(0xFFUL << ccmr_channel_pos); // Clear channel's CCMR bits

    // CCxS = 01 (Input, ICx is mapped on TIx)
    ccmr_val |= (1U << (0 + ccmr_channel_pos));

    // Input prescaler (ICxPSC) - no prescaling for input capture
    ccmr_val &= ~(3U << (2 + ccmr_channel_pos));

    // Input filter (ICxF) - no filtering for now (0000)
    ccmr_val &= ~(0xFUL << (4 + ccmr_channel_pos));

    REG_ACCESS(timer_base + ccmr_offset) = ccmr_val;
    WDT_Reset();

    // Configure CCER for trigger edge
    uint32_t ccer_val = REG_ACCESS(timer_base + TIM_CCER_OFFSET);
    ccer_val &= ~(0xAU << (timer_channel_idx * 4)); // Clear CCxP (polarity) and CCxNP (non-polarity) bits

    if (icu_edge == ICU_EDGE_RISING) {
        ccer_val &= ~(1U << (1 + timer_channel_idx * 4)); // CCxP = 0 (rising edge)
    } else if (icu_edge == ICU_EDGE_FALLING) {
        ccer_val |= (1U << (1 + timer_channel_idx * 4));  // CCxP = 1 (falling edge)
    } else { // ICU_EDGE_BOTH - typically toggle CCxP and CCxNP for this, but not supported directly in TIM.
             // Usually done with EXTI or by changing polarity on the fly. For now, defaulting to rising.
        ccer_val &= ~(1U << (1 + timer_channel_idx * 4)); // CCxP = 0 (rising edge)
    }

    ccer_val |= (1U << (timer_channel_idx * 4)); // Enable Capture/Compare output (CCxE)
    REG_ACCESS(timer_base + TIM_CCER_OFFSET) = ccer_val;
    WDT_Reset();

    // Clear and enable Capture/Compare interrupt
    REG_ACCESS(timer_base + TIM_SR_OFFSET) = 0; // Clear all pending interrupts
    REG_ACCESS(timer_base + TIM_DIER_OFFSET) |= (1U << (timer_channel_idx + 1)); // CCxIE (Capture/Compare interrupt enable)
    WDT_Reset();

    // Generate an update event to load the Prescaler and ARR values
    REG_ACCESS(timer_base + TIM_EGR_OFFSET) |= (1U << 0); // UG bit
    WDT_Reset();
}

/**
 * @brief Enables an ICU channel.
 * @param icu_channel The ICU channel to enable.
 */
void ICU_Enable(t_icu_channel icu_channel) {
    WDT_Reset();
    volatile uint32_t *timer_base = get_timer_base_addr((t_timer_channel)icu_channel);
    if (timer_base == NULL) return;

    // Enable Timer counter
    REG_ACCESS(timer_base + TIM_CR1_OFFSET) |= (1U << 0); // CEN bit
}

/**
 * @brief Disables an ICU channel.
 * @param icu_channel The ICU channel to disable.
 */
void ICU_Disable(t_icu_channel icu_channel) {
    WDT_Reset();
    volatile uint32_t *timer_base = get_timer_base_addr((t_timer_channel)icu_channel);
    if (timer_base == NULL) return;

    // Disable Timer counter
    REG_ACCESS(timer_base + TIM_CR1_OFFSET) &= ~(1U << 0); // Clear CEN bit
    // Disable Capture/Compare Interrupt
    uint32_t timer_channel_idx = 0;
    // Map icu_channel to timer_channel_idx (e.g., ICU_CHANNEL_TIM1_CH1 -> 0)
    // This mapping logic needs to be robust for all ICU_CHANNEL_TIMx_CHy values
    if (icu_channel >= ICU_CHANNEL_TIM1_CH1 && icu_channel <= ICU_CHANNEL_TIM1_CH4) timer_channel_idx = (icu_channel - ICU_CHANNEL_TIM1_CH1);
    else if (icu_channel >= ICU_CHANNEL_TIM2_CH1 && icu_channel <= ICU_CHANNEL_TIM2_CH4) timer_channel_idx = (icu_channel - ICU_CHANNEL_TIM2_CH1);
    // ... add for other timers
    else if (icu_channel >= ICU_CHANNEL_TIM9_CH1 && icu_channel <= ICU_CHANNEL_TIM9_CH2) timer_channel_idx = (icu_channel - ICU_CHANNEL_TIM9_CH1);
    else if (icu_channel == ICU_CHANNEL_TIM10_CH1) timer_channel_idx = 0;
    else if (icu_channel == ICU_CHANNEL_TIM11_CH1) timer_channel_idx = 0;

    REG_ACCESS(timer_base + TIM_DIER_OFFSET) &= ~(1U << (timer_channel_idx + 1)); // Clear CCxIE bit
}

/**
 * @brief Gets the frequency measured by an ICU channel.
 * @param icu_channel The ICU channel to use.
 * @return The measured frequency. Returns 0 if unable to measure.
 *
 * This is a conceptual implementation. Real frequency measurement would require
 * two captures on consecutive edges to determine period.
 */
uint32_t ICU_GetFrequency(t_icu_channel icu_channel) {
    WDT_Reset();
    volatile uint32_t *timer_base = get_timer_base_addr((t_timer_channel)icu_channel);
    if (timer_base == NULL) return 0;

    uint32_t timer_channel_idx = 0; // 0 for CH1, 1 for CH2, etc.
    uint32_t ccr_offset;

    // Map icu_channel to timer_channel_idx and ccr_offset
    if (icu_channel >= ICU_CHANNEL_TIM1_CH1 && icu_channel <= ICU_CHANNEL_TIM1_CH4) {
        timer_channel_idx = (icu_channel - ICU_CHANNEL_TIM1_CH1);
    } else if (icu_channel >= ICU_CHANNEL_TIM2_CH1 && icu_channel <= ICU_CHANNEL_TIM2_CH4) {
        timer_channel_idx = (icu_channel - ICU_CHANNEL_TIM2_CH1);
    } else if (icu_channel >= ICU_CHANNEL_TIM3_CH1 && icu_channel <= ICU_CHANNEL_TIM3_CH4) {
        timer_channel_idx = (icu_channel - ICU_CHANNEL_TIM3_CH1);
    } else if (icu_channel >= ICU_CHANNEL_TIM4_CH1 && icu_channel <= ICU_CHANNEL_TIM4_CH4) {
        timer_channel_idx = (icu_channel - ICU_CHANNEL_TIM4_CH1);
    } else if (icu_channel >= ICU_CHANNEL_TIM5_CH1 && icu_channel <= ICU_CHANNEL_TIM5_CH4) {
        timer_channel_idx = (icu_channel - ICU_CHANNEL_TIM5_CH1);
    } else if (icu_channel >= ICU_CHANNEL_TIM9_CH1 && icu_channel <= ICU_CHANNEL_TIM9_CH2) {
        timer_channel_idx = (icu_channel - ICU_CHANNEL_TIM9_CH1);
    } else if (icu_channel == ICU_CHANNEL_TIM10_CH1) {
        timer_channel_idx = 0;
    } else if (icu_channel == ICU_CHANNEL_TIM11_CH1) {
        timer_channel_idx = 0;
    } else {
        return 0; // Invalid channel
    }
    WDT_Reset();

    ccr_offset = TIM_CCR1_OFFSET + (timer_channel_idx * 4);

