ELARABY-AI-Team/Main_Generator/MCAL_C_Files/STM32F401RC_MCAL.c
    // This is a placeholder. A proper frequency measurement requires:
    // 1. Storing two consecutive capture values.
    // 2. Calculating the difference (period).
    // 3. Knowing the timer's clock frequency and prescaler to convert period to time.
    // 4. Frequency = 1 / Period.
    // For now, return a dummy value based on current capture.
    uint32_t capture_val = REG_ACCESS(timer_base + ccr_offset);
    (void)capture_val; // Suppress unused warning

    // Example calculation (highly simplified, assumes 1Hz resolution if timer clock is 1Hz after prescaler/ARR)
    uint32_t timer_clock_freq_hz = 0;
    switch (icu_channel) {
        case ICU_CHANNEL_TIM1_CH1: case ICU_CHANNEL_TIM1_CH2: case ICU_CHANNEL_TIM1_CH3: case ICU_CHANNEL_TIM1_CH4:
        case ICU_CHANNEL_TIM9_CH1: case ICU_CHANNEL_TIM9_CH2: case ICU_CHANNEL_TIM10_CH1: case ICU_CHANNEL_TIM11_CH1:
            timer_clock_freq_hz = 84000000; break;
        case ICU_CHANNEL_TIM2_CH1: case ICU_CHANNEL_TIM2_CH2: case ICU_CHANNEL_TIM2_CH3: case ICU_CHANNEL_TIM2_CH4:
        case ICU_CHANNEL_TIM3_CH1: case ICU_CHANNEL_TIM3_CH2: case ICU_CHANNEL_TIM3_CH3: case ICU_CHANNEL_TIM3_CH4:
        case ICU_CHANNEL_TIM4_CH1: case ICU_CHANNEL_TIM4_CH2: case ICU_CHANNEL_TIM4_CH3: case ICU_CHANNEL_TIM4_CH4:
        case ICU_CHANNEL_TIM5_CH1: case ICU_CHANNEL_TIM5_CH2: case ICU_CHANNEL_TIM5_CH3: case ICU_CHANNEL_TIM5_CH4:
            timer_clock_freq_hz = 42000000; break;
        default: timer_clock_freq_hz = 1; break; // Avoid division by zero
    }
    WDT_Reset();

    uint32_t psc_val = REG_ACCESS(timer_base + TIM_PSC_OFFSET) + 1; // Actual prescaler value
    uint32_t timer_tick_freq = timer_clock_freq_hz / psc_val;

    // Placeholder: Return a fixed value or simple calculation.
    // In a real scenario, this would involve volatile static variables or a buffer to store multiple capture events
    // and an interrupt handler to update them.
    return timer_tick_freq / 1000; // Return something indicative, e.g., KHz if tick is fast
}

/**
 * @brief Sets a callback function for an ICU channel.
 * @param callback Pointer to the callback function.
 */
void ICU_setCallback(void (*callback)(void)) {
    WDT_Reset();
    // This requires a more complex mapping from ICU channel to an internal array of callbacks.
    // For simplicity, this implementation assigns it to a global EXTI callback if that's the underlying mechanism.
    // In a full implementation, you'd register `callback` against a specific `icu_channel`.
    if (callback != NULL) {
        // Assuming a generic EXTI line 0 callback for demonstration.
        // A robust solution would map `icu_channel` to its corresponding EXTI line
        // and store the callback in `icu_callback_ptr[exti_line]`.
        icu_callback_ptr[0] = callback;
    }
}

// Timer APIs
/**
 * @brief Initializes a specified Timer channel.
 *        Configures the timer for basic counting (up-counting, no PWM, no capture).
 * @param timer_channel The Timer channel to initialize.
 */
void TIMER_Init(t_timer_channel timer_channel) {
    WDT_Reset();
    volatile uint32_t *timer_base = get_timer_base_addr(timer_channel);
    if (timer_base == NULL) return;

    // Enable timer clock
    switch (timer_channel) {
        case TIMER_CH_1: REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM1EN_Pos); break;
        case TIMER_CH_2: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM2EN_Pos); break;
        case TIMER_CH_3: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM3EN_Pos); break;
        case TIMER_CH_4: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM4EN_Pos); break;
        case TIMER_CH_5: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM5EN_Pos); break;
        case TIMER_CH_9: REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM9EN_Pos); break;
        case TIMER_CH_10: REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM10EN_Pos); break;
        case TIMER_CH_11: REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM11EN_Pos); break;
        default: return; // Invalid channel
    }
    WDT_Reset();

    // Disable timer before configuring
    REG_ACCESS(timer_base + TIM_CR1_OFFSET) &= ~(1U << 0); // Clear CEN bit

    // Configure CR1: Up-counting mode, auto-reload preload enable
    REG_ACCESS(timer_base + TIM_CR1_OFFSET) = (1U << 7); // ARPE (Auto-Reload Preload Enable)

    // Clear DIER (DMA/Interrupt enable register) for basic timer
    REG_ACCESS(timer_base + TIM_DIER_OFFSET) = 0;

    // Reset counter, prescaler, and auto-reload to default
    REG_ACCESS(timer_base + TIM_CNT_OFFSET) = 0;
    REG_ACCESS(timer_base + TIM_PSC_OFFSET) = 0;
    REG_ACCESS(timer_base + TIM_ARR_OFFSET) = 0xFFFFFFFF; // Max value for 32-bit (TIM2/5) or 16-bit timer

    // Generate update event to load configurations
    REG_ACCESS(timer_base + TIM_EGR_OFFSET) |= (1U << 0); // UG bit
    WDT_Reset();
}

/**
 * @brief Sets a timer to generate an interrupt after a specified number of microseconds.
 * @param timer_channel The Timer channel to use.
 * @param time The time in microseconds.
 */
void TIMER_Set_us(t_timer_channel timer_channel, tword time) {
    WDT_Reset();
    volatile uint32_t *timer_base = get_timer_base_addr(timer_channel);
    if (timer_base == NULL) return;

    uint32_t timer_clock_freq;
    if (timer_channel == TIMER_CH_1 || timer_channel == TIMER_CH_9 || timer_channel == TIMER_CH_10 || timer_channel == TIMER_CH_11) {
        timer_clock_freq = 84000000; // APB2 timers
    } else {
        timer_clock_freq = 42000000; // APB1 timers
    }
    WDT_Reset();

    // Reset timer
    REG_ACCESS(timer_base + TIM_CR1_OFFSET) &= ~(1U << 0); // Disable
    REG_ACCESS(timer_base + TIM_CNT_OFFSET) = 0; // Clear counter

    // Calculate PSC and ARR
    // Target period = time (us)
    // F_timer = timer_clock_freq / (PSC + 1)
    // ARR = (F_timer * TargetPeriod_s) - 1
    // ARR = (timer_clock_freq / (PSC + 1)) * (time / 1000000.0) - 1
    // For 1 us tick: PSC = timer_clock_freq / 1000000 - 1
    tword psc = (tword)((timer_clock_freq / 1000000U) - 1); // 1us tick
    tword arr = time - 1;

    REG_ACCESS(timer_base + TIM_PSC_OFFSET) = psc;
    REG_ACCESS(timer_base + TIM_ARR_OFFSET) = arr;
    WDT_Reset();

    // Enable Update Interrupt
    REG_ACCESS(timer_base + TIM_DIER_OFFSET) |= (1U << 0); // UIE (Update Interrupt Enable)
    REG_ACCESS(timer_base + TIM_SR_OFFSET) = 0; // Clear pending update flag
    WDT_Reset();
}

/**
 * @brief Sets a timer to generate an interrupt after a specified number of milliseconds.
 * @param timer_channel The Timer channel to use.
 * @param time The time in milliseconds.
 */
void TIMER_Set_Time_ms(t_timer_channel timer_channel, tword time) {
    WDT_Reset();
    volatile uint32_t *timer_base = get_timer_base_addr(timer_channel);
    if (timer_base == NULL) return;

    uint32_t timer_clock_freq;
    if (timer_channel == TIMER_CH_1 || timer_channel == TIMER_CH_9 || timer_channel == TIMER_CH_10 || timer_channel == TIMER_CH_11) {
        timer_clock_freq = 84000000; // APB2 timers
    } else {
        timer_clock_freq = 42000000; // APB1 timers
    }
    WDT_Reset();

    // Reset timer
    REG_ACCESS(timer_base + TIM_CR1_OFFSET) &= ~(1U << 0); // Disable
    REG_ACCESS(timer_base + TIM_CNT_OFFSET) = 0; // Clear counter

    // For 1ms tick: PSC = timer_clock_freq / 1000 - 1
    tword psc = (tword)((timer_clock_freq / 1000U) - 1);
    tword arr = time - 1;

    REG_ACCESS(timer_base + TIM_PSC_OFFSET) = psc;
    REG_ACCESS(timer_base + TIM_ARR_OFFSET) = arr;
    WDT_Reset();

    // Enable Update Interrupt
    REG_ACCESS(timer_base + TIM_DIER_OFFSET) |= (1U << 0); // UIE
    REG_ACCESS(timer_base + TIM_SR_OFFSET) = 0; // Clear pending update flag
    WDT_Reset();
}

/**
 * @brief Sets a timer to generate an interrupt after a specified number of seconds.
 * @param timer_channel The Timer channel to use.
 * @param time The time in seconds.
 */
void TIMER_Set_Time_sec(t_timer_channel timer_channel, tbyte time) {
    WDT_Reset();
    // Use ms function with conversion
    TIMER_Set_Time_ms(timer_channel, (tword)time * 1000);
}

/**
 * @brief Sets a timer to generate an interrupt after a specified number of minutes.
 * @param timer_channel The Timer channel to use.
 * @param time The time in minutes.
 */
void TIMER_Set_Time_min(t_timer_channel timer_channel, tbyte time) {
    WDT_Reset();
    // Use ms function with conversion
    TIMER_Set_Time_ms(timer_channel, (tword)time * 60 * 1000);
}

/**
 * @brief Sets a timer to generate an interrupt after a specified number of hours.
 * @param timer_channel The Timer channel to use.
 * @param time The time in hours.
 */
void TIMER_Set_Time_hour(t_timer_channel timer_channel, tbyte time) {
    WDT_Reset();
    // Use ms function with conversion
    TIMER_Set_Time_ms(timer_channel, (tword)time * 60 * 60 * 1000);
}

/**
 * @brief Enables a specified Timer channel.
 * @param timer_channel The Timer channel to enable.
 */
void TIMER_Enable(t_timer_channel timer_channel) {
    WDT_Reset();
    volatile uint32_t *timer_base = get_timer_base_addr(timer_channel);
    if (timer_base == NULL) return;

    // Enable timer clock (redundant if Init called, but safe)
    switch (timer_channel) {
        case TIMER_CH_1: REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM1EN_Pos); break;
        case TIMER_CH_2: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM2EN_Pos); break;
        case TIMER_CH_3: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM3EN_Pos); break;
        case TIMER_CH_4: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM4EN_Pos); break;
        case TIMER_CH_5: REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM5EN_Pos); break;
        case TIMER_CH_9: REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM9EN_Pos); break;
        case TIMER_CH_10: REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM10EN_Pos); break;
        case TIMER_CH_11: REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_TIM11EN_Pos); break;
        default: return; // Invalid channel
    }
    WDT_Reset(); // Call WDT_Reset before setting the enable bit.

    REG_ACCESS(timer_base + TIM_CR1_OFFSET) |= (1U << 0); // Set CEN bit
}

/**
 * @brief Disables a specified Timer channel.
 * @param timer_channel The Timer channel to disable.
 */
void TIMER_Disable(t_timer_channel timer_channel) {
    WDT_Reset();
    volatile uint32_t *timer_base = get_timer_base_addr(timer_channel);
    if (timer_base == NULL) return;

    REG_ACCESS(timer_base + TIM_CR1_OFFSET) &= ~(1U << 0); // Clear CEN bit
    REG_ACCESS(timer_base + TIM_DIER_OFFSET) &= ~(1U << 0); // Clear UIE (Update Interrupt Enable)
    // Also disable peripheral clock to save power
    switch (timer_channel) {
        case TIMER_CH_1: REG_ACCESS(RCC_APB2ENR_ADDR) &= ~(1U << RCC_APB2ENR_TIM1EN_Pos); break;
        case TIMER_CH_2: REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_TIM2EN_Pos); break;
        case TIMER_CH_3: REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_TIM3EN_Pos); break;
        case TIMER_CH_4: REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_TIM4EN_Pos); break;
        case TIMER_CH_5: REG_ACCESS(RCC_APB1ENR_ADDR) &= ~(1U << RCC_APB1ENR_TIM5EN_Pos); break;
        case TIMER_CH_9: REG_ACCESS(RCC_APB2ENR_ADDR) &= ~(1U << RCC_APB2ENR_TIM9EN_Pos); break;
        case TIMER_CH_10: REG_ACCESS(RCC_APB2ENR_ADDR) &= ~(1U << RCC_APB2ENR_TIM10EN_Pos); break;
        case TIMER_CH_11: REG_ACCESS(RCC_APB2ENR_ADDR) &= ~(1U << RCC_APB2ENR_TIM11EN_Pos); break;
        default: break;
    }
    WDT_Reset();
}

// ADC APIs
/**
 * @brief Initializes the ADC channel with specified mode.
 * @param adc_channel The ADC channel to initialize.
 * @param adc_mode The ADC operating mode (e.g., Single Conversion, Continuous).
 */
void ADC_Init(t_adc_channel adc_channel, t_adc_mode_t adc_mode) {
    WDT_Reset();
    // Enable ADC1 clock
    REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_ADC1EN_Pos); // Infer: RCC_APB2ENR bit 8
    WDT_Reset();

    // Disable ADC before configuration
    REG_ACCESS(ADC1_CR2_ADDR) &= ~(1U << 0); // Clear ADON bit

    // Configure ADC Common Control Register (CCR) - default values for basic operation
    // E.g., ADCPRE (prescaler), multi-mode disable, Vrefint enable
    REG_ACCESS(ADC_CCR_ADDR) = (2U << 16) | (1U << 23); // PCLK2/4 prescaler, TSVREFE (Temperature sensor and VREFINT enable)
    WDT_Reset();

    // Configure CR1: resolution, scan mode, discontinuous mode, watchdog
    REG_ACCESS(ADC1_CR1_ADDR) = 0; // Default to 12-bit, single-channel, no watchdog etc.
    if (adc_mode == ADC_MODE_CONTINUOUS) {
        REG_ACCESS(ADC1_CR2_ADDR) |= (1U << 1); // CONT bit for continuous conversion
    }
    WDT_Reset();

    // Configure CR2: external trigger selection, right alignment, SWSTART
    REG_ACCESS(ADC1_CR2_ADDR) = (0U << 10) | (0U << 8); // No external trigger, Right alignment

    // Configure Sample Time for the selected channel (SMPR1 for channels 10-18, SMPR2 for 0-9)
    uint32_t channel_num = (uint32_t)adc_channel;
    if (channel_num >= 10 && channel_num <= 18) {
        // SMPR1 configures channels 10-18 (3 bits per channel, starting at bit 0 for channel 10)
        REG_ACCESS(ADC1_SMPR1_ADDR) &= ~(0x7UL << ((channel_num - 10) * 3));
        REG_ACCESS(ADC1_SMPR1_ADDR) |= (ADC_SAMPLE_TIME_480_CYCLES << ((channel_num - 10) * 3)); // Use a long sample time
    } else if (channel_num >= 0 && channel_num <= 9) {
        // SMPR2 configures channels 0-9 (3 bits per channel, starting at bit 0 for channel 0)
        REG_ACCESS(ADC1_SMPR2_ADDR) &= ~(0x7UL << (channel_num * 3));
        REG_ACCESS(ADC1_SMPR2_ADDR) |= (ADC_SAMPLE_TIME_480_CYCLES << (channel_num * 3)); // Use a long sample time
    }
    WDT_Reset();

    // Configure Regular Sequence (SQR3 for first 6 conversions)
    // L bits in SQR1 define number of conversions. Default to 0000 (1 conversion)
    REG_ACCESS(ADC1_SQR1_ADDR) &= ~(0xFUL << 20); // Clear L bits (set to 0 for 1 conversion)
    REG_ACCESS(ADC1_SQR3_ADDR) = channel_num; // Set SQ1 to the desired channel
    WDT_Reset();
}

/**
 * @brief Enables the ADC module.
 * @param adc_channel The ADC channel to enable (redundant but kept for API consistency).
 */
void ADC_Enable(t_adc_channel adc_channel) {
    WDT_Reset();
    REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_ADC1EN_Pos); // Enable peripheral clock (inferred)
    WDT_Reset(); // Call WDT_Reset before setting the enable bit.

