ELARABY-AI-Team/Main_Generator/MCAL_C_Files/STM32F401RC_MCAL.c
    REG_ACCESS(ADC1_CR2_ADDR) |= (1U << 0); // Set ADON bit
    // Wait for ADC to stabilize (~10us or more)
    for (volatile int i = 0; i < 1000; i++); // Simple delay
    WDT_Reset();
}

/**
 * @brief Disables the ADC module.
 * @param adc_channel The ADC channel to disable (redundant but kept for API consistency).
 */
void ADC_Disable(t_adc_channel adc_channel) {
    WDT_Reset();
    REG_ACCESS(ADC1_CR2_ADDR) &= ~(1U << 0); // Clear ADON bit
    REG_ACCESS(RCC_APB2ENR_ADDR) &= ~(1U << RCC_APB2ENR_ADC1EN_Pos); // Disable peripheral clock
    WDT_Reset();
}

/**
 * @brief Performs an ADC conversion in polling mode.
 * @param adc_channel The ADC channel to read.
 * @return The converted 16-bit digital value.
 */
tword ADC_Get_POLLING(t_adc_channel adc_channel) {
    WDT_Reset();
    // Start conversion
    REG_ACCESS(ADC1_CR2_ADDR) |= (1U << 30); // SWSTART bit
    WDT_Reset();

    // Wait for EOC (End Of Conversion) flag
    while (!(REG_ACCESS(ADC1_SR_ADDR) & (1U << 1))) { /* max timeout implied */ }
    REG_ACCESS(ADC1_SR_ADDR) &= ~(1U << 1); // Clear EOC flag by writing 0 (or read DR)

    // Read converted data
    tword adc_value = (tword)(REG_ACCESS(ADC1_DR_ADDR) & 0xFFFF);
    WDT_Reset();
    return adc_value;
}

/**
 * @brief Placeholder for ADC conversion in interrupt mode.
 *        This function only reads the data register, assuming an ISR handles the conversion.
 * @param adc_channel The ADC channel to read.
 * @return The converted 16-bit digital value.
 */
tword ADC_Get_INTERRUPT(t_adc_channel adc_channel) {
    WDT_Reset();
    // Enable EOC interrupt if not already
    REG_ACCESS(ADC1_CR1_ADDR) |= (1U << 5); // EOCIE bit
    WDT_Reset();

    // In an interrupt-driven system, the conversion would be started elsewhere
    // and the ISR would read the DR. This function just returns the last DR value.
    // For testing/demonstration, you might trigger a SWSTART here too.
    REG_ACCESS(ADC1_CR2_ADDR) |= (1U << 30); // SWSTART bit

    // In a real interrupt driven scenario, this function would not block.
    // It would return a stored value or trigger a conversion and rely on an ISR.
    // For this direct register access, we'll do a blocking read to get a value.
    while (!(REG_ACCESS(ADC1_SR_ADDR) & (1U << 1))) { /* Wait for EOC flag */ }
    REG_ACCESS(ADC1_SR_ADDR) &= ~(1U << 1); // Clear EOC flag

    tword adc_value = (tword)(REG_ACCESS(ADC1_DR_ADDR) & 0xFFFF);
    WDT_Reset();
    return adc_value;
}

// Internal_EEPROM - Using Flash memory as proxy
// Note: STM32F401RC does not have a dedicated internal EEPROM.
// EEPROM functionality is typically emulated using a dedicated Flash sector.
// The provided register_json lists general Flash control registers, not EEPROM emulation specifics.
// A full implementation would involve Flash erase/write cycles, error handling,
// and wear-leveling algorithms. This is a simplified placeholder.

/**
 * @brief Initializes the internal EEPROM (Flash emulation).
 *        This is a placeholder for Flash-based EEPROM emulation.
 */
void Internal_EEPROM_Init(void) {
    WDT_Reset();
    // For Flash emulation, typically enable Flash controller clock (already enabled by default)
    // Unlock Flash Controller if needed for write/erase operations.
    // (Flash access is usually available without explicit clock enable from RCC for core Flash)
    // REG_ACCESS(FLASH_KEYR_ADDR) = FLASH_KEY1; // Example unlock sequence
    // REG_ACCESS(FLASH_KEYR_ADDR) = FLASH_KEY2;
    // ... further setup for Flash programming/erase if needed.
}

/**
 * @brief Sets a byte in the internal EEPROM (Flash emulation).
 * @param address The address within the emulated EEPROM.
 * @param data The byte data to write.
 * Note: Actual Flash programming involves erasing sectors/pages and then writing words/half-words.
 *       Direct byte writes are not usually supported without a complex emulation layer.
 *       This function is a placeholder and will not perform actual flash write operations without a full Flash driver.
 */
void Internal_EEPROM_Set(tbyte address, tbyte data) {
    WDT_Reset();
    // Placeholder: In a real Flash EEPROM emulation, this would involve:
    // 1. Unlocking Flash.
    // 2. Erasing the target Flash sector if necessary.
    // 3. Writing the 'data' at 'address' (which would be mapped to a Flash address).
    // 4. Locking Flash.
    // This cannot be safely implemented with just the `FLASH_CR` and `FLASH_KEYR` registers
    // without full Flash programming algorithms and error checking.
    // Adding a comment to indicate this limitation.
    // printf("Warning: Internal_EEPROM_Set not fully implemented for Flash emulation.\n");
    (void)address; // Suppress unused parameter warning
    (void)data;    // Suppress unused parameter warning
}

/**
 * @brief Gets a byte from the internal EEPROM (Flash emulation).
 * @param address The address within the emulated EEPROM.
 * @return The byte data read.
 * Note: Reading from Flash is typically direct memory access after mapping.
 */
tbyte Internal_EEPROM_Get(tbyte address) {
    WDT_Reset();
    // Placeholder: In a real Flash EEPROM emulation, this would involve:
    // 1. Mapping the 'address' to a physical Flash memory address.
    // 2. Directly reading from that Flash address.
    // Assuming a base Flash address for emulation, e.g., 0x0800C000 (part of Flash)
    volatile tbyte *flash_ptr = (volatile tbyte *)(0x0800C000 + address); // Example base address for EEPROM sector
    tbyte data = *flash_ptr;
    WDT_Reset();
    return data;
}

// TT (Time Triggered OS)
// This is a skeletal implementation for a time-triggered scheduler.
// A timer (e.g., SysTick or TIMx) will be used to generate ticks for TT_ISR.

#define MAX_TASKS 10
typedef struct {
    void (*task_func)(void);
    tword period;
    tword delay;
    bool enabled;
    tword run_count; // For internal use
} TT_Task_t;

static TT_Task_t tt_tasks[MAX_TASKS];
static tbyte tt_next_task_id = 0;
static tword tt_tick_count = 0;
static volatile uint32_t *tt_timer_base = NULL; // Assuming TIM2 for TT
static uint32_t tt_timer_clock_freq = 0;

/**
 * @brief Initializes the Time Triggered (TT) OS with a specified tick time.
 * @param tick_time_ms The tick time in milliseconds.
 */
void TT_Init(t_tick_time tick_time_ms) {
    WDT_Reset();

    // Initialize task list
    for (tbyte i = 0; i < MAX_TASKS; i++) {
        tt_tasks[i].task_func = NULL;
        tt_tasks[i].period = 0;
        tt_tasks[i].delay = 0;
        tt_tasks[i].enabled = false;
        tt_tasks[i].run_count = 0;
    }
    tt_next_task_id = 0;
    tt_tick_count = 0;

