ELARABY-AI-Team/Main_Generator/MCAL_C_Files/STM32F401RC_MCAL.c
    // Configure a timer for the TT_ISR (e.g., TIM2)
    tt_timer_base = (volatile uint32_t *)TIM2_BASE_ADDR;
    tt_timer_clock_freq = 42000000; // Assuming APB1 clock for TIM2

    // Enable TIM2 clock
    REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_TIM2EN_Pos);
    WDT_Reset();

    // Disable timer before configuring
    REG_ACCESS(tt_timer_base + TIM_CR1_OFFSET) &= ~(1U << 0);

    // Calculate PSC and ARR for desired tick_time_ms
    // For 1ms tick: PSC = timer_clock_freq / 1000 - 1
    tword psc = (tword)((tt_timer_clock_freq / 1000U) - 1);
    tword arr = tick_time_ms - 1;

    REG_ACCESS(tt_timer_base + TIM_PSC_OFFSET) = psc;
    REG_ACCESS(tt_timer_base + TIM_ARR_OFFSET) = arr;
    WDT_Reset();

    // Enable Update Interrupt
    REG_ACCESS(tt_timer_base + TIM_DIER_OFFSET) |= (1U << 0); // UIE
    REG_ACCESS(tt_timer_base + TIM_SR_OFFSET) = 0; // Clear pending update flag
    WDT_Reset();

    // Enable TIM2 interrupt in NVIC (inferred)
    NVIC_EnableIRQ(TIM2_IRQn);
    WDT_Reset();
}

/**
 * @brief Starts the Time Triggered (TT) OS scheduler.
 */
void TT_Start(void) {
    WDT_Reset();
    if (tt_timer_base != NULL) {
        REG_ACCESS(tt_timer_base + TIM_CR1_OFFSET) |= (1U << 0); // Set CEN bit
    }
}

/**
 * @brief Dispatches tasks based on their period and delay.
 *        This function should be called in the main loop.
 */
void TT_Dispatch_task(void) {
    WDT_Reset();
    for (tbyte i = 0; i < MAX_TASKS; i++) {
        if (tt_tasks[i].task_func != NULL && tt_tasks[i].enabled) {
            if (tt_tasks[i].run_count == 0) {
                tt_tasks[i].task_func();
                tt_tasks[i].run_count = tt_tasks[i].period; // Reload period
            }
        }
    }
}

/**
 * @brief Interrupt Service Routine (ISR) for the Time Triggered (TT) OS.
 *        This function decrements task counters and should be called by the timer ISR.
 */
void TT_ISR(void) {
    WDT_Reset(); // WDT_Reset in ISR should be quick and not block
    tt_tick_count++; // Global tick counter

    for (tbyte i = 0; i < MAX_TASKS; i++) {
        if (tt_tasks[i].task_func != NULL && tt_tasks[i].enabled) {
            if (tt_tasks[i].delay > 0) {
                tt_tasks[i].delay--;
            } else {
                if (tt_tasks[i].run_count > 0) {
                    tt_tasks[i].run_count--;
                }
            }
        }
    }
}

/**
 * @brief Adds a task to the TT scheduler.
 * @param task Pointer to the task function.
 * @param period The period of the task in ticks.
 * @param delay The initial delay of the task in ticks.
 * @return The index of the added task, or 0xFF if failed.
 */
tbyte TT_Add_task(void (*task)(void), const tword period, const tword delay) {
    WDT_Reset();
    if (tt_next_task_id < MAX_TASKS) {
        tt_tasks[tt_next_task_id].task_func = task;
        tt_tasks[tt_next_task_id].period = period;
        tt_tasks[tt_next_task_id].delay = delay;
        tt_tasks[tt_next_task_id].enabled = true;
        tt_tasks[tt_next_task_id].run_count = delay; // Initial delay
        return tt_next_task_id++;
    }
    return 0xFF; // Failed to add task
}

/**
 * @brief Deletes a task from the TT scheduler.
 * @param task_index The index of the task to delete.
 */
void TT_Delete_task(const tbyte task_index) {
    WDT_Reset();
    if (task_index < MAX_TASKS) {
        tt_tasks[task_index].task_func = NULL;
        tt_tasks[task_index].enabled = false;
    }
}

// Optional Modules (skipped if registers/drivers not found)
// As per Rules.json, these modules are optional and only implemented if registers/drivers exist.
// Since specific registers/drivers for these modules are NOT found in the provided register_json
// for the STM32F401RC, they are skipped.

// MCAL_OUTPUT_BUZZER not supported on this MCU (no dedicated buzzer registers in JSON)
// DAC not supported on this MCU (no dedicated DAC registers in JSON)
// MQTT Protocol not supported on this MCU (high-level protocol, no direct register support)
// HTTP Protocol not supported on this MCU (high-level protocol, no direct register support)
// WiFi Driver not supported on this MCU (high-level protocol, no direct register support)
// DTC_driver not supported on this MCU (requires specific DMA/DTC registers not present in JSON for a complete driver)

// I2S APIs
/**
 * @brief Initializes an I2S channel.
 * @param channel The I2S channel to initialize (e.g., I2S_CHANNEL_1).
 * @param mode I2S operating mode (Master/Slave, Transmit/Receive).
 * @param standard I2S standard (Philips, MSB, LSB, PCM).
 * @param data_format I2S data format (16-bit, 24-bit, 32-bit).
 * @param channel_mode I2S channel mode (stereo, mono).
 * @param sample_rate I2S audio sample rate.
 * @param mclk_freq Master clock frequency (if used).
 * @param dma_buffer_size DMA buffer size (if using DMA).
 */
void I2S_Init(t_i2s_channel channel, I2S_Mode_t mode, I2S_Standard_t standard, I2S_DataFormat_t data_format, I2S_ChannelMode_t channel_mode, uint32_t sample_rate, uint32_t mclk_freq, uint32_t dma_buffer_size) {
    WDT_Reset();
    volatile uint32_t *spi_base = NULL;

    switch (channel) {
        case I2S_CHANNEL_1:
            spi_base = (volatile uint32_t *)SPI1_BASE_ADDR;
            REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_SPI1EN_Pos); // Enable peripheral clock for SPI1 (I2S1)
            break;
        case I2S_CHANNEL_2:
            spi_base = (volatile uint32_t *)SPI2_BASE_ADDR;
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_SPI2EN_Pos); // Enable peripheral clock for SPI2 (I2S2)
            break;
        case I2S_CHANNEL_3:
            spi_base = (volatile uint32_t *)SPI3_BASE_ADDR;
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_SPI3EN_Pos); // Enable peripheral clock for SPI3 (I2S3)
            break;
        default:
            return; // Invalid channel
    }
    WDT_Reset();

    // Disable I2S before configuration
    REG_ACCESS(spi_base + SPI_I2SCFGR_OFFSET) &= ~(1U << 7); // Clear I2SE bit

    // Configure I2SCFGR register
    uint32_t i2scfgr_val = (1U << 10); // I2SMOD = 1 (I2S mode selected)

    // Mode selection (Master/Slave, Tx/Rx)
    if (mode == I2S_MODE_MASTER_TX)      i2scfgr_val |= (3U << 8); // I2SCFG = 11 (Master Transmit)
    else if (mode == I2S_MODE_MASTER_RX) i2scfgr_val |= (2U << 8); // I2SCFG = 10 (Master Receive)
    else if (mode == I2S_MODE_SLAVE_TX)  i2scfgr_val |= (1U << 8); // I2SCFG = 01 (Slave Transmit)
    else if (mode == I2S_MODE_SLAVE_RX)  i2scfgr_val |= (0U << 8); // I2SCFG = 00 (Slave Receive)

    // I2S Standard
    if (standard == I2S_STANDARD_PHILIPS)    i2scfgr_val |= (0U << 4); // I2SSTD = 00
    else if (standard == I2S_STANDARD_MSB)   i2scfgr_val |= (1U << 4); // I2SSTD = 01
    else if (standard == I2S_STANDARD_LSB)   i2scfgr_val |= (2U << 4); // I2SSTD = 10
    else if (standard == I2S_STANDARD_PCM_SHORT) i2scfgr_val |= (3U << 4); // I2SSTD = 11 (PCM Short)

    // Data format (CHLEN, DATLEN)
    if (data_format == I2S_DATAFORMAT_16B)      i2scfgr_val |= (0U << 1); // DATLEN = 00
    else if (data_format == I2S_DATAFORMAT_24B) i2scfgr_val |= (1U << 1); // DATLEN = 01
    else if (data_format == I2S_DATAFORMAT_32B) i2scfgr_val |= (2U << 1); // DATLEN = 10

