ELARABY-AI-Team/Main_Generator/MCAL_C_Files/STM32F401RC_MCAL.c
    if (channel_mode == I2S_CHANNELMODE_MONO) i2scfgr_val |= (1U << 0); // CHLEN = 1 (mono)

    REG_ACCESS(spi_base + SPI_I2SCFGR_OFFSET) = i2scfgr_val;
    WDT_Reset();

    // Configure I2SPR for sample rate
    // I2SPR.MCKOE, I2SDIV, ODD bits
    // Fs = I2Sclk / ((10 * 2 * I2SDIV) + ((10 * ODD) - 2 * DATLEN)) for master
    // Simplified: Use common I2S_PR registers from the clock tree to set exact rates.
    // For a typical sample rate calculation on STM32F4, you need PLLI2S_R and PLLI2S_N
    // (from RCC_PLLI2SCFGR) and then the I2SDIV and ODD bits in SPI_I2SPR.
    // This requires complex clock configuration not fully expressible with given registers and API.
    // For now, setting a common prescaler value.
    // Assuming a generic calculation or pre-calculated values for Fs.
    tword i2sdiv = 2; // Minimum valid I2SDIV is 2
    tbyte odd = 0;

    // A real implementation would calculate these based on System Clock and Sample Rate
    // For example, if PLLI2S_R = 3, and PLLI2S_N = 192 for 48kHz, then I2SDIV/ODD are used to fine-tune.
    // This is a placeholder for `sample_rate` to `I2SDIV/ODD` calculation.
    (void)sample_rate; (void)mclk_freq; (void)dma_buffer_size;

    REG_ACCESS(spi_base + SPI_I2SPR_OFFSET) = (i2sdiv & 0xFF) | ((odd & 0x1) << 8); // I2SDIV & ODD
    WDT_Reset();
}

/**
 * @brief Enables a specified I2S channel.
 * @param channel The I2S channel to enable.
 */
void I2S_Enable(t_i2s_channel channel) {
    WDT_Reset();
    volatile uint32_t *spi_base = NULL;

    switch (channel) {
        case I2S_CHANNEL_1:
            REG_ACCESS(RCC_APB2ENR_ADDR) |= (1U << RCC_APB2ENR_SPI1EN_Pos); // Enable peripheral clock (inferred)
            spi_base = (volatile uint32_t *)SPI1_BASE_ADDR;
            break;
        case I2S_CHANNEL_2:
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_SPI2EN_Pos); // Enable peripheral clock (inferred)
            spi_base = (volatile uint32_t *)SPI2_BASE_ADDR;
            break;
        case I2S_CHANNEL_3:
            REG_ACCESS(RCC_APB1ENR_ADDR) |= (1U << RCC_APB1ENR_SPI3EN_Pos); // Enable peripheral clock (inferred)
            spi_base = (volatile uint32_t *)SPI3_BASE_ADDR;
            break;
        default:
            return; // Invalid channel
    }
    WDT_Reset(); // Call WDT_Reset before setting the enable bit.

    if (spi_base != NULL) {
        REG_ACCESS(spi_base + SPI_I2SCFGR_OFFSET) |= (1U << 7); // Set I2SE bit
    }
}

/**
 * @brief Transmits data over the specified I2S channel.
 * @param channel The I2S channel to use.
 * @param data Pointer to the data buffer.
 * @param length The length of the data to transmit.
 */
void I2S_Transmit(t_i2s_channel channel, const void *data, size_t length) {
    WDT_Reset();
    volatile uint32_t *spi_base = NULL;

    switch (channel) {
        case I2S_CHANNEL_1: spi_base = (volatile uint32_t *)SPI1_BASE_ADDR; break;
        case I2S_CHANNEL_2: spi_base = (volatile uint32_t *)SPI2_BASE_ADDR; break;
        case I2S_CHANNEL_3: spi_base = (volatile uint32_t *)SPI3_BASE_ADDR; break;
        default: return; // Invalid channel
    }
    WDT_Reset();

    if (spi_base != NULL) {
        const uint16_t *tx_data = (const uint16_t *)data; // Assuming 16-bit data words for I2S
        for (size_t i = 0; i < length / sizeof(uint16_t); i++) {
            while (!(REG_ACCESS(spi_base + SPI_SR_OFFSET) & (1U << 1))) { /* Wait for TXE flag */ }
            REG_ACCESS(spi_base + SPI_DR_OFFSET) = tx_data[i];
        }
    }
}

/**
 * @brief Receives data from the specified I2S channel.
 * @param channel The I2S channel to use.
 * @param buffer Pointer to the buffer to store received data.
 * @param length The length of data to receive.
 */
void I2S_Receive(t_i2s_channel channel, void *buffer, size_t length) {
    WDT_Reset();
    volatile uint32_t *spi_base = NULL;

    switch (channel) {
        case I2S_CHANNEL_1: spi_base = (volatile uint32_t *)SPI1_BASE_ADDR; break;
        case I2S_CHANNEL_2: spi_base = (volatile uint32_t *)SPI2_BASE_ADDR; break;
        case I2S_CHANNEL_3: spi_base = (volatile uint32_t *)SPI3_BASE_ADDR; break;
        default: return; // Invalid channel
    }
    WDT_Reset();

    if (spi_base != NULL) {
        uint16_t *rx_buffer = (uint16_t *)buffer; // Assuming 16-bit data words for I2S
        for (size_t i = 0; i < length / sizeof(uint16_t); i++) {
            while (!(REG_ACCESS(spi_base + SPI_SR_OFFSET) & (1U << 0))) { /* Wait for RXNE flag */ }
            rx_buffer[i] = (uint16_t)REG_ACCESS(spi_base + SPI_DR_OFFSET);
        }
    }
}

// =========================================================================
//                  TIMER INTERRUPT HANDLERS (Example for TT)
// =========================================================================

// Example TIM2_IRQHandler for TT_ISR
void TIM2_IRQHandler(void) {
    WDT_Reset(); // Reset watchdog in ISR
    if (REG_ACCESS(TIM2_BASE_ADDR + TIM_SR_OFFSET) & (1U << 0)) { // Check UIF (Update Interrupt Flag)
        REG_ACCESS(TIM2_BASE_ADDR + TIM_SR_OFFSET) &= ~(1U << 0); // Clear UIF
        TT_ISR(); // Call the Time Triggered OS ISR
    }
}

// Example External Interrupt Handler
void EXTI0_IRQHandler(void) {
    WDT_Reset();
    if (REG_ACCESS(EXTI_PR_ADDR) & (1U << 0)) { // Check if EXTI line 0 pending
        REG_ACCESS(EXTI_PR_ADDR) = (1U << 0); // Clear pending bit
        if (icu_callback_ptr[0] != NULL) {
            icu_callback_ptr[0]();
        }
    }
}
// Add other EXTI handlers (EXTI1_IRQHandler, EXTI2_IRQHandler, etc. up to EXTI15_10_IRQHandler) as needed.